Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2018 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                       schema-version="4.3.1"
                       xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
   <file timestamp="2020-11-19T13:00:12Z"/>
   <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
      <variant ordercode="SAMHA1G17A-MB-B"
               mhc:ordercode="ATSAMHA1G17A-MB-B"
               package="QFN48"
               pinout="SAMHAxG1xA"
               speedmax="48000000"
               tempmin="-40"
               tempmax="105"
               vccmin="2.7"
               vccmax="3.63"/>
   </variants>
   <devices>
      <device name="ATSAMHA1G17AB"
              architecture="CORTEX-M0PLUS"
              family="SAMH"
              series="SAMHA1">
         <address-spaces>
            <address-space id="base"
                           name="base"
                           start="0"
                           size="0x100000000"
                           endianness="little">
               <memory-segment name="FLASH"
                               start="0x00000000"
                               size="0x20000"
                               type="flash"
                               pagesize="64"
                               rw="RW"
                               exec="true"/>
               <memory-segment name="AUX0"
                               start="0x00804000"
                               size="0x100"
                               type="fuses"
                               pagesize="64"
                               rw="RW"/>
               <memory-segment name="AUX1"
                               start="0x00806000"
                               size="0x100"
                               type="fuses"
                               pagesize="64"
                               rw="RW"/>
               <memory-segment name="AUX3"
                               start="0x0080A000"
                               size="0x100"
                               type="fuses"
                               pagesize="64"
                               rw="RW"/>
               <memory-segment name="CAL"
                               start="0x00800000"
                               size="0x8"
                               type="fuses"
                               rw="R"/>
               <memory-segment name="LOCKBIT"
                               start="0x00802000"
                               size="0x4"
                               type="fuses"
                               rw="R"/>
               <memory-segment name="OTP1"
                               start="0x00806000"
                               size="0x8"
                               type="fuses"
                               rw="R"/>
               <memory-segment name="OTP2"
                               start="0x00806008"
                               size="0x8"
                               type="fuses"
                               rw="R"/>
               <memory-segment name="OTP4"
                               start="0x00806020"
                               size="0xE0"
                               type="fuses"
                               pagesize="64"
                               rw="RW"/>
               <memory-segment name="TEMP_LOG"
                               start="0x00806030"
                               size="0x8"
                               type="fuses"
                               rw="R"/>
               <memory-segment name="USER_PAGE"
                               start="0x00804000"
                               size="0x100"
                               type="user_page"
                               pagesize="64"
                               rw="RW"/>
               <memory-segment name="RWW"
                               start="0x00400000"
                               size="0x1000"
                               type="flash"
                               pagesize="64"
                               rw="RW"
                               exec="true"/>
               <memory-segment name="HMCRAMC0"
                               start="0x20000000"
                               size="0x4000"
                               type="ram"
                               rw="RW"
                               exec="true"/>
               <memory-segment name="HPB0"
                               start="0x40000000"
                               size="0x10000"
                               type="io"
                               rw="RW"/>
               <memory-segment name="HPB1"
                               start="0x41000000"
                               size="0x10000"
                               type="io"
                               rw="RW"/>
               <memory-segment name="HPB2"
                               start="0x42000000"
                               size="0x10000"
                               type="io"
                               rw="RW"/>
               <memory-segment name="PPB"
                               start="0xE0000000"
                               size="0x100000"
                               type="io"
                               rw="RW"/>
               <memory-segment name="SCS"
                               start="0xE000E000"
                               size="0x00001000"
                               type="io"
                               rw="RW"/>
               <memory-segment name="PERIPHERALS"
                               start="0x40000000"
                               size="0x20000000"
                               type="io"
                               rw="RW"/>
            </address-space>
            <address-space id="fuses"
                           name="fuses"
                           start="0x00000000"
                           size="0x20000000"
                           endianness="little"/>
         </address-spaces>
         <parameters>
            <param name="NUM_IRQ" value="30" caption="Number of Interrupt Requests"/>
            <param name="__CM0PLUS_REV" value="0x0001" caption="Cortex-M0+ revision"/>
            <param name="__MPU_PRESENT" value="0" caption="MPU feature implemented"/>
            <param name="__NVIC_PRIO_BITS"
                   value="2"
                   caption="Number of NVIC priority bits"/>
            <param name="__VTOR_PRESENT"
                   value="1"
                   caption="Vector Table Offset Register feature implemented"/>
            <param name="__Vendor_SysTickConfig"
                   value="0"
                   caption="SysTick feature implemented"/>
            <param name="__ARCH_ARM" value="1"/>
            <param name="__ARCH_ARM_CORTEX_M" value="1"/>
            <param name="__DEVICE_IS_SAM" value="1"/>
         </parameters>
         <peripherals>
            <module name="AC" id="U2205" version="1.1.2">
               <instance name="AC">
                  <register-group name="AC"
                                  name-in-module="AC"
                                  address-space="base"
                                  offset="0x42004400"/>
                  <signals>
                     <signal group="AIN" index="0" function="B" pad="PA04"/>
                     <signal group="AIN" index="1" function="B" pad="PA05"/>
                     <signal group="AIN" index="2" function="B" pad="PA06"/>
                     <signal group="AIN" index="3" function="B" pad="PA07"/>
                     <signal group="CMP" index="0" function="H" pad="PA18"/>
                     <signal group="CMP" index="1" function="H" pad="PA19"/>
                  </signals>
                  <parameters>
                     <param name="CMP_NUM" value="2" caption="Number of comparators"/>
                     <param name="GCLK_ID_ANA"
                            value="32"
                            caption="Index of Generic Clock for analog"/>
                     <param name="GCLK_ID_DIG"
                            value="31"
                            caption="Index of Generic Clock for digital"/>
                     <param name="NUM_CMP" value="2"/>
                     <param name="PAIRS" value="1" caption="Number of pairs of comparators"/>
                     <param name="INSTANCE_ID" value="81"/>
                  </parameters>
               </instance>
            </module>
            <module name="ADC" id="U2204" version="1.2.0">
               <instance name="ADC">
                  <register-group name="ADC"
                                  name-in-module="ADC"
                                  address-space="base"
                                  offset="0x42004000"/>
                  <signals>
                     <signal group="AIN" index="0" function="B" pad="PA02"/>
                     <signal group="AIN" index="1" function="B" pad="PA03"/>
                     <signal group="AIN" index="4" function="B" pad="PA04"/>
                     <signal group="AIN" index="5" function="B" pad="PA05"/>
                     <signal group="AIN" index="6" function="B" pad="PA06"/>
                     <signal group="AIN" index="7" function="B" pad="PA07"/>
                     <signal group="AIN" index="11" function="B" pad="PB03"/>
                     <signal group="AIN" index="14" function="B" pad="PB06"/>
                     <signal group="AIN" index="15" function="B" pad="PB07"/>
                     <signal group="AIN" index="16" function="B" pad="PA08"/>
                     <signal group="AIN" index="17" function="B" pad="PA09"/>
                     <signal group="AIN" index="18" function="B" pad="PA10"/>
                     <signal group="AIN" index="19" function="B" pad="PA11"/>
                     <signal group="VREFP" function="B" pad="PA04"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RESRDY"
                            value="39"
                            caption="Index of DMA RESRDY trigger"/>
                     <param name="EXTCHANNEL_MSB"
                            value="19"
                            caption="Number of external channels"/>
                     <param name="GCLK_ID" value="30" caption="Index of Generic Clock"/>
                     <param name="RESULT_BITS"
                            value="16"
                            caption="Size of RESULT.RESULT bitfield"/>
                     <param name="RESULT_MSB" value="15" caption="Size of Result"/>
                     <param name="INSTANCE_ID" value="80"/>
                  </parameters>
               </instance>
            </module>
            <module name="DAC" id="U2214" version="1.1.0">
               <instance name="DAC">
                  <register-group name="DAC"
                                  name-in-module="DAC"
                                  address-space="base"
                                  offset="0x42004800"/>
                  <signals>
                     <signal group="VOUT" function="B" pad="PA02"/>
                     <signal group="VREFP" function="B" pad="PA03"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_EMPTY"
                            value="40"
                            caption="Index of DMAC EMPTY trigger"/>
                     <param name="GCLK_ID" value="33" caption="Index of Generic Clock"/>
                     <param name="INSTANCE_ID" value="82"/>
                  </parameters>
               </instance>
            </module>
            <module name="DMAC" id="U2223" version="1.2.0">
               <instance name="DMAC">
                  <register-group name="DMAC"
                                  name-in-module="DMAC"
                                  address-space="base"
                                  offset="0x41004800"/>
                  <parameters>
                     <param name="CH_BITS" value="4" caption="Number of bits to select channel"/>
                     <param name="CH_NUM" value="12" caption="Number of channels"/>
                     <param name="EVIN_NUM" value="4" caption="Number of input events"/>
                     <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
                     <param name="LVL_BITS"
                            value="2"
                            caption="Number of bit to select level priority"/>
                     <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
                     <param name="TRIG_BITS"
                            value="6"
                            caption="Number of bits to select trigger source"/>
                     <param name="TRIG_NUM" value="50" caption="Number of peripheral triggers"/>
                     <param name="INSTANCE_ID" value="36"/>
                  </parameters>
               </instance>
            </module>
            <module name="DSU" id="U2209" version="2.0.4">
               <instance name="DSU">
                  <register-group name="DSU"
                                  name-in-module="DSU"
                                  address-space="base"
                                  offset="0x41002000"/>
                  <parameters>
                     <param name="INSTANCE_ID" value="33"/>
                  </parameters>
               </instance>
            </module>
            <module name="EIC" id="U2217" version="1.0.1">
               <instance name="EIC">
                  <register-group name="EIC"
                                  name-in-module="EIC"
                                  address-space="base"
                                  offset="0x40001800"/>
                  <signals>
                     <signal group="EXTINT" index="0" function="A" pad="PA16"/>
                     <signal group="EXTINT" index="0" function="A" pad="PB16"/>
                     <signal group="EXTINT" index="0" function="A" pad="PA00"/>
                     <signal group="EXTINT" index="1" function="A" pad="PA17"/>
                     <signal group="EXTINT" index="1" function="A" pad="PB17"/>
                     <signal group="EXTINT" index="1" function="A" pad="PA01"/>
                     <signal group="EXTINT" index="2" function="A" pad="PA02"/>
                     <signal group="EXTINT" index="2" function="A" pad="PA18"/>
                     <signal group="EXTINT" index="3" function="A" pad="PA03"/>
                     <signal group="EXTINT" index="3" function="A" pad="PA19"/>
                     <signal group="EXTINT" index="3" function="A" pad="PB03"/>
                     <signal group="EXTINT" index="4" function="A" pad="PA04"/>
                     <signal group="EXTINT" index="4" function="A" pad="PA20"/>
                     <signal group="EXTINT" index="5" function="A" pad="PA05"/>
                     <signal group="EXTINT" index="5" function="A" pad="PA21"/>
                     <signal group="EXTINT" index="6" function="A" pad="PA06"/>
                     <signal group="EXTINT" index="6" function="A" pad="PB06"/>
                     <signal group="EXTINT" index="6" function="A" pad="PB22"/>
                     <signal group="EXTINT" index="7" function="A" pad="PA07"/>
                     <signal group="EXTINT" index="7" function="A" pad="PB07"/>
                     <signal group="EXTINT" index="7" function="A" pad="PB23"/>
                     <signal group="EXTINT" index="8" function="A" pad="PA28"/>
                     <signal group="EXTINT" index="9" function="A" pad="PA09"/>
                     <signal group="EXTINT" index="10" function="A" pad="PA10"/>
                     <signal group="EXTINT" index="10" function="A" pad="PA30"/>
                     <signal group="EXTINT" index="10" function="A" pad="PB10"/>
                     <signal group="EXTINT" index="11" function="A" pad="PA11"/>
                     <signal group="EXTINT" index="11" function="A" pad="PA31"/>
                     <signal group="EXTINT" index="11" function="A" pad="PB11"/>
                     <signal group="EXTINT" index="14" function="A" pad="PB30"/>
                     <signal group="EXTINT" index="14" function="A" pad="PA14"/>
                     <signal group="EXTINT" index="15" function="A" pad="PA27"/>
                     <signal group="EXTINT" index="15" function="A" pad="PA15"/>
                     <signal group="NMI" function="A" pad="PA08"/>
                  </signals>
                  <parameters>
                     <param name="CONFIG_NUM" value="2" caption="Number of CONFIG registers"/>
                     <param name="EXTINT_NUM"
                            value="16"
                            caption="Number of External Interrupts"/>
                     <param name="GCLK_ID" value="5" caption="Index of Generic Clock"/>
                     <param name="INSTANCE_ID" value="6"/>
                  </parameters>
               </instance>
            </module>
            <module name="EVSYS" id="U2208" version="1.0.1">
               <instance name="EVSYS">
                  <register-group name="EVSYS"
                                  name-in-module="EVSYS"
                                  address-space="base"
                                  offset="0x42000400"/>
                  <parameters>
                     <param name="CHANNELS" value="12" caption="Number of Channels"/>
                     <param name="CHANNELS_BITS"
                            value="4"
                            caption="Number of bits to select Channel"/>
                     <param name="CHANNELS_MSB" value="11" caption="Number of Channels - 1"/>
                     <param name="EXTEVT_NUM"
                            value="0"
                            caption="Number of External Event Generators"/>
                     <param name="GCLK_ID_0" value="7" caption="Index of Generic Clock 0"/>
                     <param name="GCLK_ID_1" value="8" caption="Index of Generic Clock 1"/>
                     <param name="GCLK_ID_2" value="9" caption="Index of Generic Clock 2"/>
                     <param name="GCLK_ID_3" value="10" caption="Index of Generic Clock 3"/>
                     <param name="GCLK_ID_4" value="11" caption="Index of Generic Clock 4"/>
                     <param name="GCLK_ID_5" value="12" caption="Index of Generic Clock 5"/>
                     <param name="GCLK_ID_6" value="13" caption="Index of Generic Clock 6"/>
                     <param name="GCLK_ID_7" value="14" caption="Index of Generic Clock 7"/>
                     <param name="GCLK_ID_8" value="15" caption="Index of Generic Clock 8"/>
                     <param name="GCLK_ID_9" value="16" caption="Index of Generic Clock 9"/>
                     <param name="GCLK_ID_10" value="17" caption="Index of Generic Clock 10"/>
                     <param name="GCLK_ID_11" value="18" caption="Index of Generic Clock 11"/>
                     <param name="GENERATORS"
                            value="83"
                            caption="Total Number of Event Generators"/>
                     <param name="GENERATORS_BITS"
                            value="7"
                            caption="Number of bits to select Event Generator"/>
                     <param name="USERS" value="37" caption="Total Number of Event Users"/>
                     <param name="USERS_BITS"
                            value="6"
                            caption="Number of bits to select Event User"/>
                     <param name="INSTANCE_ID" value="65"/>
                  </parameters>
               </instance>
            </module>
            <module name="GCLK" id="U2102" version="2.1.0">
               <instance name="GCLK">
                  <register-group name="GCLK"
                                  name-in-module="GCLK"
                                  address-space="base"
                                  offset="0x40000C00"/>
                  <signals>
                     <signal group="IO" index="0" function="H" pad="PB22"/>
                     <signal group="IO" index="0" function="H" pad="PA14"/>
                     <signal group="IO" index="0" function="H" pad="PA27"/>
                     <signal group="IO" index="0" function="H" pad="PA28"/>
                     <signal group="IO" index="0" function="H" pad="PA30"/>
                     <signal group="IO" index="1" function="H" pad="PB23"/>
                     <signal group="IO" index="1" function="H" pad="PA15"/>
                     <signal group="IO" index="2" function="H" pad="PB16"/>
                     <signal group="IO" index="2" function="H" pad="PA16"/>
                     <signal group="IO" index="3" function="H" pad="PA17"/>
                     <signal group="IO" index="3" function="H" pad="PB17"/>
                     <signal group="IO" index="4" function="H" pad="PA10"/>
                     <signal group="IO" index="4" function="H" pad="PA20"/>
                     <signal group="IO" index="4" function="H" pad="PB10"/>
                     <signal group="IO" index="5" function="H" pad="PA11"/>
                     <signal group="IO" index="5" function="H" pad="PA21"/>
                     <signal group="IO" index="5" function="H" pad="PB11"/>
                  </signals>
                  <parameters>
                     <param name="GENDIV_BITS" value="16"/>
                     <param name="GEN_NUM"
                            value="9"
                            caption="Number of Generic Clock Generators"/>
                     <param name="GEN_NUM_MSB"
                            value="8"
                            caption="Number of Generic Clock Generators - 1"/>
                     <param name="GEN_SOURCE_NUM_MSB"
                            value="8"
                            caption="Number of Generic Clock Sources - 1"/>
                     <param name="NUM" value="38" caption="Number of Generic Clock Users"/>
                     <param name="SOURCE_DFLL48M" value="7" caption="DFLL48M output"/>
                     <param name="SOURCE_FDPLL" value="8" caption="FDPLL output"/>
                     <param name="SOURCE_GCLKGEN1"
                            value="2"
                            caption="Generic clock generator 1 output"/>
                     <param name="SOURCE_GCLKIN" value="1" caption="Generator input pad"/>
                     <param name="SOURCE_NUM"
                            value="9"
                            caption="Number of Generic Clock Sources"/>
                     <param name="SOURCE_OSCULP32K"
                            value="3"
                            caption="OSCULP32K oscillator output"/>
                     <param name="SOURCE_OSC8M" value="6" caption="OSC8M oscillator output"/>
                     <param name="SOURCE_OSC32K" value="4" caption="OSC32K oscillator outpur"/>
                     <param name="SOURCE_XOSC" value="0" caption="XOSC oscillator output"/>
                     <param name="SOURCE_XOSC32K" value="5" caption="XOSC32K oscillator output"/>
                     <param name="INSTANCE_ID" value="3"/>
                  </parameters>
               </instance>
            </module>
