Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
               <instance name="SERCOM2">
                  <register-group name="SERCOM2"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42001000"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PA08"/>
                     <signal group="PAD" index="1" function="D" pad="PA09"/>
                     <signal group="PAD" index="2" function="D" pad="PA10"/>
                     <signal group="PAD" index="2" function="C" pad="PA14"/>
                     <signal group="PAD" index="3" function="D" pad="PA11"/>
                     <signal group="PAD" index="3" function="C" pad="PA15"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="5" caption="Index of DMA RX trigger"/>
                     <param name="DMAC_ID_TX" value="6" caption="Index of DMA TX trigger"/>
                     <param name="GCLK_ID_CORE"
                            value="22"
                            caption="Index of Generic Clock for Core"/>
                     <param name="GCLK_ID_SLOW"
                            value="19"
                            caption="Index of Generic Clock for SMbus timeout"/>
                     <param name="INT_MSB" value="6"/>
                     <param name="INSTANCE_ID" value="68"/>
                  </parameters>
               </instance>
               <instance name="SERCOM3">
                  <register-group name="SERCOM3"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42001400"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PA16"/>
                     <signal group="PAD" index="1" function="D" pad="PA17"/>
                     <signal group="PAD" index="2" function="D" pad="PA18"/>
                     <signal group="PAD" index="2" function="D" pad="PA20"/>
                     <signal group="PAD" index="3" function="D" pad="PA19"/>
                     <signal group="PAD" index="3" function="D" pad="PA21"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="7" caption="Index of DMA RX trigger"/>
                     <param name="DMAC_ID_TX" value="8" caption="Index of DMA TX trigger"/>
                     <param name="GCLK_ID_CORE"
                            value="23"
                            caption="Index of Generic Clock for Core"/>
                     <param name="GCLK_ID_SLOW"
                            value="19"
                            caption="Index of Generic Clock for SMbus timeout"/>
                     <param name="INT_MSB" value="6"/>
                     <param name="INSTANCE_ID" value="69"/>
                  </parameters>
               </instance>
               <instance name="SERCOM4">
                  <register-group name="SERCOM4"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42001800"/>
                  <signals>
                     <signal group="PAD" index="2" function="D" pad="PA14"/>
                     <signal group="PAD" index="2" function="D" pad="PB10"/>
                     <signal group="PAD" index="3" function="D" pad="PA15"/>
                     <signal group="PAD" index="3" function="D" pad="PB11"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="9" caption="Index of DMA RX trigger"/>
                     <param name="DMAC_ID_TX" value="10" caption="Index of DMA TX trigger"/>
                     <param name="GCLK_ID_CORE"
                            value="24"
                            caption="Index of Generic Clock for Core"/>
                     <param name="GCLK_ID_SLOW"
                            value="19"
                            caption="Index of Generic Clock for SMbus timeout"/>
                     <param name="INT_MSB" value="6"/>
                     <param name="INSTANCE_ID" value="70"/>
                  </parameters>
               </instance>
               <instance name="SERCOM5">
                  <register-group name="SERCOM5"
                                  name-in-module="SERCOM"
                                  address-space="base"
                                  offset="0x42001C00"/>
                  <signals>
                     <signal group="PAD" index="0" function="D" pad="PB30"/>
                     <signal group="PAD" index="0" function="C" pad="PB16"/>
                     <signal group="PAD" index="1" function="D" pad="PB03"/>
                     <signal group="PAD" index="1" function="C" pad="PB17"/>
                     <signal group="PAD" index="2" function="D" pad="PB22"/>
                     <signal group="PAD" index="2" function="C" pad="PA20"/>
                     <signal group="PAD" index="3" function="D" pad="PB23"/>
                     <signal group="PAD" index="3" function="C" pad="PA21"/>
                  </signals>
                  <parameters>
                     <param name="DMAC_ID_RX" value="11" caption="Index of DMA RX trigger"/>
                     <param name="DMAC_ID_TX" value="12" caption="Index of DMA TX trigger"/>
                     <param name="GCLK_ID_CORE"
                            value="25"
                            caption="Index of Generic Clock for Core"/>
                     <param name="GCLK_ID_SLOW"
                            value="19"
                            caption="Index of Generic Clock for SMbus timeout"/>
                     <param name="INT_MSB" value="6"/>
                     <param name="INSTANCE_ID" value="71"/>
                  </parameters>
               </instance>
            </module>
            <module name="SYSCTRL" id="U2100" version="2.0.1">
               <instance name="SYSCTRL">
                  <register-group name="SYSCTRL"
                                  name-in-module="SYSCTRL"
                                  address-space="base"
                                  offset="0x40000800"/>
                  <signals>
                     <signal group="XIN" function="XIN" pad="PA14"/>
                     <signal group="XIN32" function="XIN32" pad="PA00"/>
                     <signal group="XOUT" function="XOUT" pad="PA15"/>
                     <signal group="XOUT32" function="XOUT32" pad="PA01"/>
                  </signals>
                  <parameters>
                     <param name="BGAP_CALIB_MSB" value="11"/>
                     <param name="BOD33_CALIB_MSB" value="5"/>
                     <param name="DFLL48M_COARSE_MSB" value="5"/>
                     <param name="DFLL48M_FINE_MSB" value="9"/>
                     <param name="GCLK_ID_DFLL48"
                            value="0"
                            caption="Index of Generic Clock for DFLL48"/>
                     <param name="GCLK_ID_FDPLL"
                            value="1"
                            caption="Index of Generic Clock for DPLL"/>
                     <param name="GCLK_ID_FDPLL32K"
                            value="2"
                            caption="Index of Generic Clock for DPLL 32K"/>
                     <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
                     <param name="POR33_ENTEST_MSB" value="1"/>
                     <param name="SYSTEM_CLOCK"
                            value="1000000"
                            caption="Initial system clock frequency"/>
                     <param name="ULPVREF_DIVLEV_MSB" value="3"/>
                     <param name="ULPVREG_FORCEGAIN_MSB" value="1"/>
                     <param name="ULPVREG_RAMREFSEL_MSB" value="2"/>
                     <param name="VREF_CONTROL_MSB" value="48"/>
                     <param name="VREF_STATUS_MSB" value="7"/>
                     <param name="VREG_LEVEL_MSB" value="2"/>
                     <param name="BOD12_VERSION" value="0x112"/>
                     <param name="BOD33_VERSION" value="0x112"/>
                     <param name="DFLL48M_VERSION" value="0x301"/>
                     <param name="FDPLL_VERSION" value="0x111"/>
                     <param name="OSCULP32K_VERSION" value="0x111"/>
                     <param name="OSC8M_VERSION" value="0x120"/>
                     <param name="OSC32K_VERSION" value="0x112"/>
                     <param name="VREF_VERSION" value="0x201"/>
                     <param name="VREG_VERSION" value="0x201"/>
                     <param name="XOSC_VERSION" value="0x114"/>
                     <param name="XOSC32K_VERSION" value="0x113"/>
                     <param name="INSTANCE_ID" value="2"/>
                  </parameters>
               </instance>
            </module>
