Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="SCALER"
                      offset="0x20"
                      rw="RW"
                      size="1"
                      count="2"
                      initval="0x00"
                      caption="Scaler n">
               <bitfield name="VALUE" caption="Scaler Value" mask="0x3F"/>
            </register>
         </register-group>
         <value-group name="AC_STATUSA__WSTATE0">
            <value name="ABOVE" caption="Signal is above window" value="0"/>
            <value name="INSIDE" caption="Signal is inside window" value="1"/>
            <value name="BELOW" caption="Signal is below window" value="2"/>
         </value-group>
         <value-group name="AC_STATUSA__WSTATE1">
            <value name="ABOVE" caption="Signal is above window" value="0"/>
            <value name="INSIDE" caption="Signal is inside window" value="1"/>
            <value name="BELOW" caption="Signal is below window" value="2"/>
         </value-group>
         <value-group name="AC_STATUSC__WSTATE0">
            <value name="ABOVE" caption="Signal is above window" value="0"/>
            <value name="INSIDE" caption="Signal is inside window" value="1"/>
            <value name="BELOW" caption="Signal is below window" value="2"/>
         </value-group>
         <value-group name="AC_STATUSC__WSTATE1">
            <value name="ABOVE" caption="Signal is above window" value="0"/>
            <value name="INSIDE" caption="Signal is inside window" value="1"/>
            <value name="BELOW" caption="Signal is below window" value="2"/>
         </value-group>
         <value-group name="AC_WINCTRL__WINTSEL0">
            <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
            <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
            <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
            <value name="OUTSIDE"
                   caption="Interrupt on signal outside window"
                   value="3"/>
         </value-group>
         <value-group name="AC_WINCTRL__WINTSEL1">
            <value name="ABOVE" caption="Interrupt on signal above window" value="0"/>
            <value name="INSIDE" caption="Interrupt on signal inside window" value="1"/>
            <value name="BELOW" caption="Interrupt on signal below window" value="2"/>
            <value name="OUTSIDE"
                   caption="Interrupt on signal outside window"
                   value="3"/>
         </value-group>
         <value-group name="AC_COMPCTRL__FLEN">
            <value name="OFF" caption="No filtering" value="0"/>
            <value name="MAJ3" caption="3-bit majority function (2 of 3)" value="1"/>
            <value name="MAJ5" caption="5-bit majority function (3 of 5)" value="2"/>
         </value-group>
         <value-group name="AC_COMPCTRL__INTSEL">
            <value name="TOGGLE"
                   caption="Interrupt on comparator output toggle"
                   value="0"/>
            <value name="RISING"
                   caption="Interrupt on comparator output rising"
                   value="1"/>
            <value name="FALLING"
                   caption="Interrupt on comparator output falling"
                   value="2"/>
            <value name="EOC"
                   caption="Interrupt on end of comparison (single-shot mode only)"
                   value="3"/>
         </value-group>
         <value-group name="AC_COMPCTRL__MUXNEG">
            <value name="PIN0" caption="I/O pin 0" value="0"/>
            <value name="PIN1" caption="I/O pin 1" value="1"/>
            <value name="PIN2" caption="I/O pin 2" value="2"/>
            <value name="PIN3" caption="I/O pin 3" value="3"/>
            <value name="GND" caption="Ground" value="4"/>
            <value name="VSCALE" caption="VDD scaler" value="5"/>
            <value name="BANDGAP" caption="Internal bandgap voltage" value="6"/>
            <value name="DAC" caption="DAC output" value="7"/>
         </value-group>
         <value-group name="AC_COMPCTRL__MUXPOS">
            <value name="PIN0" caption="I/O pin 0" value="0"/>
            <value name="PIN1" caption="I/O pin 1" value="1"/>
            <value name="PIN2" caption="I/O pin 2" value="2"/>
            <value name="PIN3" caption="I/O pin 3" value="3"/>
         </value-group>
         <value-group name="AC_COMPCTRL__OUT">
            <value name="OFF"
                   caption="The output of COMPn is not routed to the COMPn I/O port"
                   value="0"/>
            <value name="ASYNC"
                   caption="The asynchronous output of COMPn is routed to the COMPn I/O port"
                   value="1"/>
            <value name="SYNC"
                   caption="The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port"
                   value="2"/>
         </value-group>
         <value-group name="AC_COMPCTRL__SPEED">
            <value name="LOW" caption="Low speed" value="0"/>
            <value name="HIGH" caption="High speed" value="1"/>
         </value-group>
      </module>
      <module name="ADC"
              id="U2204"
              version="1.2.0"
              caption="Analog Digital Converter">
         <register-group name="ADC" caption="Analog Digital Converter">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4"/>
            </register>
            <register name="REFCTRL"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Reference Control">
               <bitfield name="REFSEL"
                         caption="Reference Selection"
                         mask="0xF"
                         values="ADC_REFCTRL__REFSEL"/>
               <bitfield name="REFCOMP"
                         caption="Reference Buffer Offset Compensation Enable"
                         mask="0x80"/>
            </register>
            <register name="AVGCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Average Control">
               <bitfield name="SAMPLENUM"
                         caption="Number of Samples to be Collected"
                         mask="0xF"
                         values="ADC_AVGCTRL__SAMPLENUM"/>
               <bitfield name="ADJRES"
                         caption="Adjusting Result / Division Coefficient"
                         mask="0x70"/>
            </register>
