Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
      <module name="DAC"
              id="U2214"
              version="1.1.0"
              caption="Digital Analog Converter">
         <register-group name="DAC" caption="Digital Analog Converter">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4"/>
            </register>
            <register name="CTRLB"
                      offset="0x1"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Control B">
               <bitfield name="EOEN" caption="External Output Enable" mask="0x1"/>
               <bitfield name="IOEN" caption="Internal Output Enable" mask="0x2"/>
               <bitfield name="LEFTADJ" caption="Left Adjusted Data" mask="0x4"/>
               <bitfield name="VPD" caption="Voltage Pump Disable" mask="0x8"/>
               <bitfield name="BDWP" caption="Bypass DATABUF Write Protection" mask="0x10"/>
               <bitfield name="REFSEL"
                         caption="Reference Selection"
                         mask="0xC0"
                         values="DAC_CTRLB__REFSEL"/>
            </register>
            <register name="EVCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Event Control">
               <bitfield name="STARTEI" caption="Start Conversion Event Input" mask="0x1"/>
               <bitfield name="EMPTYEO" caption="Data Buffer Empty Event Output" mask="0x2"/>
            </register>
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
               <bitfield name="EMPTY"
                         caption="Data Buffer Empty Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x4"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="UNDERRUN" caption="Underrun Interrupt Enable" mask="0x1"/>
               <bitfield name="EMPTY"
                         caption="Data Buffer Empty Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x4"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="UNDERRUN" caption="Underrun" mask="0x1"/>
               <bitfield name="EMPTY" caption="Data Buffer Empty" mask="0x2"/>
               <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x4"/>
            </register>
            <register name="STATUS"
                      offset="0x7"
                      rw="R"
                      access="RSYNC"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy Status" mask="0x80"/>
            </register>
            <register name="DATA"
                      offset="0x8"
                      rw="RW"
                      access="RWSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Data">
               <bitfield name="DATA" caption="Data value to be converted" mask="0xFFFF"/>
            </register>
            <register name="DATABUF"
                      offset="0xC"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Data Buffer">
               <bitfield name="DATABUF" caption="Data Buffer" mask="0xFFFF"/>
            </register>
         </register-group>
         <value-group name="DAC_CTRLB__REFSEL">
            <value name="INT1V" caption="Internal 1.0V reference" value="0"/>
            <value name="AVCC" caption="AVCC" value="1"/>
            <value name="VREFP" caption="External reference" value="2"/>
         </value-group>
      </module>
      <module name="DMAC"
              id="U2223"
              version="1.2.0"
              caption="Direct Memory Access Controller">
         <register-group name="DMAC" caption="Direct Memory Access Controller">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="DMAENABLE" caption="DMA Enable" mask="0x2"/>
               <bitfield name="CRCENABLE" caption="CRC Enable" mask="0x4"/>
               <bitfield name="LVLEN0" caption="Priority Level 0 Enable" mask="0x100"/>
               <bitfield name="LVLEN1" caption="Priority Level 1 Enable" mask="0x200"/>
               <bitfield name="LVLEN2" caption="Priority Level 2 Enable" mask="0x400"/>
               <bitfield name="LVLEN3" caption="Priority Level 3 Enable" mask="0x800"/>
            </register>
            <register name="CRCCTRL"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="CRC Control">
               <bitfield name="CRCBEATSIZE"
                         caption="CRC Beat Size"
                         mask="0x3"
                         values="DMAC_CRCCTRL__CRCBEATSIZE"/>
               <bitfield name="CRCPOLY"
                         caption="CRC Polynomial Type"
                         mask="0xC"
                         values="DMAC_CRCCTRL__CRCPOLY"/>
               <bitfield name="CRCSRC"
                         caption="CRC Input Source"
                         mask="0x3F00"
                         values="DMAC_CRCCTRL__CRCSRC"/>
            </register>
            <register name="CRCDATAIN"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="CRC Data Input">
               <bitfield name="CRCDATAIN" caption="CRC Data Input" mask="0xFFFFFFFF"/>
            </register>
            <register name="CRCCHKSUM"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="CRC Checksum">
               <bitfield name="CRCCHKSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
            </register>
