Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="CRCSTATUS"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="CRC Status">
               <bitfield name="CRCBUSY" caption="CRC Module Busy" mask="0x1"/>
               <bitfield name="CRCZERO" caption="CRC Zero" mask="0x2"/>
            </register>
            <register name="DBGCTRL"
                      offset="0xD"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
            </register>
            <register name="QOSCTRL"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      initval="0x15"
                      caption="QOS Control">
               <bitfield name="WRBQOS"
                         caption="Write-Back Quality of Service"
                         mask="0x3"
                         values="DMAC_QOSCTRL__WRBQOS"/>
               <bitfield name="FQOS"
                         caption="Fetch Quality of Service"
                         mask="0xC"
                         values="DMAC_QOSCTRL__FQOS"/>
               <bitfield name="DQOS"
                         caption="Data Transfer Quality of Service"
                         mask="0x30"
                         values="DMAC_QOSCTRL__DQOS"/>
            </register>
            <register name="SWTRIGCTRL"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Software Trigger Control">
               <bitfield name="SWTRIG0" caption="Channel 0 Software Trigger" mask="0x1"/>
               <bitfield name="SWTRIG1" caption="Channel 1 Software Trigger" mask="0x2"/>
               <bitfield name="SWTRIG2" caption="Channel 2 Software Trigger" mask="0x4"/>
               <bitfield name="SWTRIG3" caption="Channel 3 Software Trigger" mask="0x8"/>
               <bitfield name="SWTRIG4" caption="Channel 4 Software Trigger" mask="0x10"/>
               <bitfield name="SWTRIG5" caption="Channel 5 Software Trigger" mask="0x20"/>
               <bitfield name="SWTRIG6" caption="Channel 6 Software Trigger" mask="0x40"/>
               <bitfield name="SWTRIG7" caption="Channel 7 Software Trigger" mask="0x80"/>
               <bitfield name="SWTRIG8" caption="Channel 8 Software Trigger" mask="0x100"/>
               <bitfield name="SWTRIG9" caption="Channel 9 Software Trigger" mask="0x200"/>
               <bitfield name="SWTRIG10" caption="Channel 10 Software Trigger" mask="0x400"/>
               <bitfield name="SWTRIG11" caption="Channel 11 Software Trigger" mask="0x800"/>
            </register>
            <register name="PRICTRL0"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Priority Control 0">
               <bitfield name="LVLPRI0" caption="Level 0 Channel Priority Number" mask="0xF"/>
               <bitfield name="RRLVLEN0"
                         caption="Level 0 Round-Robin Scheduling Enable"
                         mask="0x80"/>
               <bitfield name="LVLPRI1"
                         caption="Level 1 Channel Priority Number"
                         mask="0xF00"/>
               <bitfield name="RRLVLEN1"
                         caption="Level 1 Round-Robin Scheduling Enable"
                         mask="0x8000"/>
               <bitfield name="LVLPRI2"
                         caption="Level 2 Channel Priority Number"
                         mask="0xF0000"/>
               <bitfield name="RRLVLEN2"
                         caption="Level 2 Round-Robin Scheduling Enable"
                         mask="0x800000"/>
               <bitfield name="LVLPRI3"
                         caption="Level 3 Channel Priority Number"
                         mask="0xF000000"/>
               <bitfield name="RRLVLEN3"
                         caption="Level 3 Round-Robin Scheduling Enable"
                         mask="0x80000000"/>
            </register>
            <register name="INTPEND"
                      offset="0x20"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Interrupt Pending">
               <bitfield name="ID" caption="Channel ID" mask="0xF"/>
               <bitfield name="TERR" caption="Transfer Error" mask="0x100"/>
               <bitfield name="TCMPL" caption="Transfer Complete" mask="0x200"/>
               <bitfield name="SUSP" caption="Channel Suspend" mask="0x400"/>
               <bitfield name="FERR" caption="Fetch Error" mask="0x2000"/>
               <bitfield name="BUSY" caption="Busy" mask="0x4000"/>
               <bitfield name="PEND" caption="Pending" mask="0x8000"/>
            </register>
            <register name="INTSTATUS"
                      offset="0x24"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Interrupt Status">
               <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1"/>
               <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2"/>
               <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4"/>
               <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8"/>
               <bitfield name="CHINT4" caption="Channel 4 Pending Interrupt" mask="0x10"/>
               <bitfield name="CHINT5" caption="Channel 5 Pending Interrupt" mask="0x20"/>
               <bitfield name="CHINT6" caption="Channel 6 Pending Interrupt" mask="0x40"/>
               <bitfield name="CHINT7" caption="Channel 7 Pending Interrupt" mask="0x80"/>
               <bitfield name="CHINT8" caption="Channel 8 Pending Interrupt" mask="0x100"/>
               <bitfield name="CHINT9" caption="Channel 9 Pending Interrupt" mask="0x200"/>
               <bitfield name="CHINT10" caption="Channel 10 Pending Interrupt" mask="0x400"/>
               <bitfield name="CHINT11" caption="Channel 11 Pending Interrupt" mask="0x800"/>
            </register>
            <register name="BUSYCH"
                      offset="0x28"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Busy Channels">
               <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
               <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
               <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
               <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
               <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10"/>
               <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20"/>
               <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40"/>
               <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80"/>
               <bitfield name="BUSYCH8" caption="Busy Channel 8" mask="0x100"/>
               <bitfield name="BUSYCH9" caption="Busy Channel 9" mask="0x200"/>
               <bitfield name="BUSYCH10" caption="Busy Channel 10" mask="0x400"/>
               <bitfield name="BUSYCH11" caption="Busy Channel 11" mask="0x800"/>
            </register>
            <register name="PENDCH"
                      offset="0x2C"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Pending Channels">
               <bitfield name="PENDCH0" caption="Pending Channel 0" mask="0x1"/>
               <bitfield name="PENDCH1" caption="Pending Channel 1" mask="0x2"/>
               <bitfield name="PENDCH2" caption="Pending Channel 2" mask="0x4"/>
               <bitfield name="PENDCH3" caption="Pending Channel 3" mask="0x8"/>
               <bitfield name="PENDCH4" caption="Pending Channel 4" mask="0x10"/>
               <bitfield name="PENDCH5" caption="Pending Channel 5" mask="0x20"/>
               <bitfield name="PENDCH6" caption="Pending Channel 6" mask="0x40"/>
               <bitfield name="PENDCH7" caption="Pending Channel 7" mask="0x80"/>
               <bitfield name="PENDCH8" caption="Pending Channel 8" mask="0x100"/>
               <bitfield name="PENDCH9" caption="Pending Channel 9" mask="0x200"/>
               <bitfield name="PENDCH10" caption="Pending Channel 10" mask="0x400"/>
               <bitfield name="PENDCH11" caption="Pending Channel 11" mask="0x800"/>
            </register>
