Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="ACTIVE"
                      offset="0x30"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Active Channel and Levels">
               <bitfield name="LVLEX0"
                         caption="Level 0 Channel Trigger Request Executing"
                         mask="0x1"/>
               <bitfield name="LVLEX1"
                         caption="Level 1 Channel Trigger Request Executing"
                         mask="0x2"/>
               <bitfield name="LVLEX2"
                         caption="Level 2 Channel Trigger Request Executing"
                         mask="0x4"/>
               <bitfield name="LVLEX3"
                         caption="Level 3 Channel Trigger Request Executing"
                         mask="0x8"/>
               <bitfield name="ID" caption="Active Channel ID" mask="0x1F00"/>
               <bitfield name="ABUSY" caption="Active Channel Busy" mask="0x8000"/>
               <bitfield name="BTCNT"
                         caption="Active Channel Block Transfer Count"
                         mask="0xFFFF0000"/>
            </register>
            <register name="BASEADDR"
                      offset="0x34"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Descriptor Memory Section Base Address">
               <bitfield name="BASEADDR"
                         caption="Descriptor Memory Base Address"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="WRBADDR"
                      offset="0x38"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Write-Back Memory Section Base Address">
               <bitfield name="WRBADDR"
                         caption="Write-Back Memory Base Address"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="CHID"
                      offset="0x3F"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Channel ID">
               <bitfield name="ID" caption="Channel ID" mask="0xF"/>
            </register>
            <register name="CHCTRLA"
                      offset="0x40"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Channel Control A">
               <bitfield name="SWRST" caption="Channel Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Channel Enable" mask="0x2"/>
            </register>
            <register name="CHCTRLB"
                      offset="0x44"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Channel Control B">
               <bitfield name="EVACT"
                         caption="Event Input Action"
                         mask="0x7"
                         values="DMAC_CHCTRLB__EVACT"/>
               <bitfield name="EVIE" caption="Channel Event Input Enable" mask="0x8"/>
               <bitfield name="EVOE" caption="Channel Event Output Enable" mask="0x10"/>
               <bitfield name="LVL"
                         caption="Channel Arbitration Level"
                         mask="0x60"
                         values="DMAC_CHCTRLB__LVL"/>
               <bitfield name="TRIGSRC"
                         caption="Peripheral Trigger Source"
                         mask="0x3F00"
                         values="DMAC_CHCTRLB__TRIGSRC"/>
               <bitfield name="TRIGACT"
                         caption="Trigger Action"
                         mask="0xC00000"
                         values="DMAC_CHCTRLB__TRIGACT"/>
               <bitfield name="CMD"
                         caption="Software Command"
                         mask="0x3000000"
                         values="DMAC_CHCTRLB__CMD"/>
            </register>
            <register name="CHINTENCLR"
                      offset="0x4C"
                      rw="RW"
                      size="1"
                      atomic-op="clear:CHINTENCLR"
                      initval="0x00"
                      caption="Channel Interrupt Enable Clear">
               <bitfield name="TERR" caption="Transfer Error Interrupt Enable" mask="0x1"/>
               <bitfield name="TCMPL"
                         caption="Transfer Complete Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
            </register>
            <register name="CHINTENSET"
                      offset="0x4D"
                      rw="RW"
                      size="1"
                      atomic-op="set:CHINTENSET"
                      initval="0x00"
                      caption="Channel Interrupt Enable Set">
               <bitfield name="TERR" caption="Transfer Error Interrupt Enable" mask="0x1"/>
               <bitfield name="TCMPL"
                         caption="Transfer Complete Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
            </register>
            <register name="CHINTFLAG"
                      offset="0x4E"
                      rw="RW"
                      size="1"
                      atomic-op="clear:CHINTFLAG"
                      initval="0x00"
                      caption="Channel Interrupt Flag Status and Clear">
               <bitfield name="TERR" caption="Transfer Error" mask="0x1"/>
               <bitfield name="TCMPL" caption="Transfer Complete" mask="0x2"/>
               <bitfield name="SUSP" caption="Channel Suspend" mask="0x4"/>
            </register>
            <register name="CHSTATUS"
                      offset="0x4F"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Channel Status">
               <bitfield name="PEND" caption="Channel Pending" mask="0x1"/>
               <bitfield name="BUSY" caption="Channel Busy" mask="0x2"/>
               <bitfield name="FERR" caption="Fetch Error" mask="0x4"/>
            </register>
         </register-group>
         <register-group name="DMAC_DESCRIPTOR"
                         caption="Direct Memory Access Controller"
                         aligned="8">
            <register name="BTCTRL"
                      offset="0x0"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Block Transfer Control">
               <bitfield name="VALID" caption="Descriptor Valid" mask="0x1"/>
               <bitfield name="EVOSEL"
                         caption="Event Output Selection"
                         mask="0x6"
                         values="DMAC_BTCTRL__EVOSEL"/>
               <bitfield name="BLOCKACT"
                         caption="Block Action"
                         mask="0x18"
                         values="DMAC_BTCTRL__BLOCKACT"/>
               <bitfield name="BEATSIZE"
                         caption="Beat Size"
                         mask="0x300"
                         values="DMAC_BTCTRL__BEATSIZE"/>
               <bitfield name="SRCINC"
                         caption="Source Address Increment Enable"
                         mask="0x400"/>
               <bitfield name="DSTINC"
                         caption="Destination Address Increment Enable"
                         mask="0x800"/>
               <bitfield name="STEPSEL"
                         caption="Step Selection"
                         mask="0x1000"
                         values="DMAC_BTCTRL__STEPSEL"/>
               <bitfield name="STEPSIZE"
                         caption="Address Increment Step Size"
                         mask="0xE000"
                         values="DMAC_BTCTRL__STEPSIZE"/>
            </register>
            <register name="BTCNT"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      caption="Block Transfer Count">
               <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
            </register>
            <register name="SRCADDR"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      caption="Transfer Source Address">
               <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
            </register>
            <register name="DSTADDR"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      caption="Transfer Destination Address">
               <bitfield name="DSTADDR"
                         caption="Transfer Destination Address"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="DESCADDR"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      caption="Next Descriptor Address">
               <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="DMAC_BTCTRL__BEATSIZE">
            <value name="BYTE" caption="8-bit access" value="0x0"/>
            <value name="HWORD" caption="16-bit access" value="0x1"/>
            <value name="WORD" caption="32-bit access" value="0x2"/>
         </value-group>
         <value-group name="DMAC_BTCTRL__BLOCKACT">
            <value name="NOACT" caption="No action" value="0x0"/>
            <value name="INT"
                   caption="Channel in normal operation and block interrupt"
                   value="0x1"/>
            <value name="SUSPEND"
                   caption="Channel suspend operation is completed"
                   value="0x2"/>
            <value name="BOTH"
                   caption="Both channel suspend operation and block interrupt"
                   value="0x3"/>
         </value-group>
