Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="DCC"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="Debug Communication Channel n">
               <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
            </register>
            <register name="DID"
                      offset="0x18"
                      rw="R"
                      size="4"
                      initval="0x10012698"
                      caption="Device Identification">
               <bitfield name="DEVSEL" caption="Device Select" mask="0xFF"/>
               <bitfield name="REVISION" caption="Revision" mask="0xF00"/>
               <bitfield name="DIE" caption="Die Identification" mask="0xF000"/>
               <bitfield name="SERIES" caption="Product Series" mask="0x3F0000"/>
               <bitfield name="FAMILY" caption="Product Family" mask="0xF800000"/>
               <bitfield name="PROCESSOR" caption="Processor" mask="0xF0000000"/>
            </register>
            <register name="ENTRY0"
                      offset="0x1000"
                      rw="R"
                      size="4"
                      initval="0x9F0FC002"
                      caption="CoreSight ROM Table Entry 0">
               <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
               <bitfield name="FMT" caption="Format" mask="0x2"/>
               <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
            </register>
            <register name="ENTRY1"
                      offset="0x1004"
                      rw="R"
                      size="4"
                      initval="0x00003002"
                      caption="CoreSight ROM Table Entry 1">
        </register>
            <register name="END"
                      offset="0x1008"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="CoreSight ROM Table End">
               <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
            </register>
            <register name="MEMTYPE"
                      offset="0x1FCC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="CoreSight ROM Table Memory Type">
               <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
            </register>
            <register name="PID4"
                      offset="0x1FD0"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral Identification 4">
               <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
               <bitfield name="FKBC" caption="4KB Count" mask="0xF0"/>
            </register>
            <register name="PID0"
                      offset="0x1FE0"
                      rw="R"
                      size="4"
                      initval="0x000000D0"
                      caption="Peripheral Identification 0">
               <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
            </register>
            <register name="PID1"
                      offset="0x1FE4"
                      rw="R"
                      size="4"
                      initval="0x000000FC"
                      caption="Peripheral Identification 1">
               <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
               <bitfield name="JEPIDCL"
                         caption="Low part of the JEP-106 Identity Code"
                         mask="0xF0"/>
            </register>
            <register name="PID2"
                      offset="0x1FE8"
                      rw="R"
                      size="4"
                      initval="0x00000009"
                      caption="Peripheral Identification 2">
               <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
               <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
               <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
            </register>
            <register name="PID3"
                      offset="0x1FEC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral Identification 3">
               <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
               <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
            </register>
            <register name="CID0"
                      offset="0x1FF0"
                      rw="R"
                      size="4"
                      initval="0x0000000D"
                      caption="Component Identification 0">
               <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
            </register>
            <register name="CID1"
                      offset="0x1FF4"
                      rw="R"
                      size="4"
                      initval="0x00000010"
                      caption="Component Identification 1">
               <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
               <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
            </register>
            <register name="CID2"
                      offset="0x1FF8"
                      rw="R"
                      size="4"
                      initval="0x00000005"
                      caption="Component Identification 2">
               <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
            </register>
            <register name="CID3"
                      offset="0x1FFC"
                      rw="R"
                      size="4"
                      initval="0x000000B1"
                      caption="Component Identification 3">
               <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
            </register>
         </register-group>
      </module>
      <module name="EIC"
              id="U2217"
              version="1.0.1"
              caption="External Interrupt Controller">
         <register-group name="EIC" caption="External Interrupt Controller">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
            </register>
            <register name="STATUS"
                      offset="0x1"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register name="NMICTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Non-Maskable Interrupt Control">
               <bitfield name="NMISENSE"
                         caption="Non-Maskable Interrupt Sense"
                         mask="0x7"
                         values="EIC_NMICTRL__NMISENSE"/>
               <bitfield name="NMIFILTEN"
                         caption="Non-Maskable Interrupt Filter Enable"
                         mask="0x8"/>
            </register>
