Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="INTENCLR"
                      offset="0x34"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x35"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0x36"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
            </register>
            <register name="RCAUSE"
                      offset="0x38"
                      rw="R"
                      size="1"
                      initval="0x01"
                      caption="Reset Cause">
               <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
               <bitfield name="BOD12" caption="Brown Out 12 Detector Reset" mask="0x2"/>
               <bitfield name="BOD33" caption="Brown Out 33 Detector Reset" mask="0x4"/>
               <bitfield name="EXT" caption="External Reset" mask="0x10"/>
               <bitfield name="WDT" caption="Watchdog Reset" mask="0x20"/>
               <bitfield name="SYST" caption="System Reset Request" mask="0x40"/>
            </register>
         </register-group>
         <value-group name="PM_SLEEP__IDLE">
            <value name="CPU" caption="The CPU clock domain is stopped" value="0"/>
            <value name="AHB"
                   caption="The CPU and AHB clock domains are stopped"
                   value="1"/>
            <value name="APB"
                   caption="The CPU, AHB and APB clock domains are stopped"
                   value="2"/>
         </value-group>
         <value-group name="PM_CPUSEL__CPUDIV">
            <value name="DIV1" caption="Divide by 1" value="0"/>
            <value name="DIV2" caption="Divide by 2" value="1"/>
            <value name="DIV4" caption="Divide by 4" value="2"/>
            <value name="DIV8" caption="Divide by 8" value="3"/>
            <value name="DIV16" caption="Divide by 16" value="4"/>
            <value name="DIV32" caption="Divide by 32" value="5"/>
            <value name="DIV64" caption="Divide by 64" value="6"/>
            <value name="DIV128" caption="Divide by 128" value="7"/>
         </value-group>
         <value-group name="PM_APBASEL__APBADIV">
            <value name="DIV1" caption="Divide by 1" value="0"/>
            <value name="DIV2" caption="Divide by 2" value="1"/>
            <value name="DIV4" caption="Divide by 4" value="2"/>
            <value name="DIV8" caption="Divide by 8" value="3"/>
            <value name="DIV16" caption="Divide by 16" value="4"/>
            <value name="DIV32" caption="Divide by 32" value="5"/>
            <value name="DIV64" caption="Divide by 64" value="6"/>
            <value name="DIV128" caption="Divide by 128" value="7"/>
         </value-group>
         <value-group name="PM_APBBSEL__APBBDIV">
            <value name="DIV1" caption="Divide by 1" value="0"/>
            <value name="DIV2" caption="Divide by 2" value="1"/>
            <value name="DIV4" caption="Divide by 4" value="2"/>
            <value name="DIV8" caption="Divide by 8" value="3"/>
            <value name="DIV16" caption="Divide by 16" value="4"/>
            <value name="DIV32" caption="Divide by 32" value="5"/>
            <value name="DIV64" caption="Divide by 64" value="6"/>
            <value name="DIV128" caption="Divide by 128" value="7"/>
         </value-group>
         <value-group name="PM_APBCSEL__APBCDIV">
            <value name="DIV1" caption="Divide by 1" value="0"/>
            <value name="DIV2" caption="Divide by 2" value="1"/>
            <value name="DIV4" caption="Divide by 4" value="2"/>
            <value name="DIV8" caption="Divide by 8" value="3"/>
            <value name="DIV16" caption="Divide by 16" value="4"/>
            <value name="DIV32" caption="Divide by 32" value="5"/>
            <value name="DIV64" caption="Divide by 64" value="6"/>
            <value name="DIV128" caption="Divide by 128" value="7"/>
         </value-group>
      </module>
      <module name="PORT" id="U2210" version="1.0.0" caption="Port Module">
         <register-group name="GROUP" size="0x80">
            <register name="DIR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Data Direction">
               <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
            </register>
            <register name="DIRCLR"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      atomic-op="clear:DIR"
                      initval="0x00000000"
                      caption="Data Direction Clear">
               <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
            </register>
            <register name="DIRSET"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      atomic-op="set:DIR"
                      initval="0x00000000"
                      caption="Data Direction Set">
               <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
            </register>
            <register name="DIRTGL"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      atomic-op="toggle:DIR"
                      initval="0x00000000"
                      caption="Data Direction Toggle">
               <bitfield name="DIRTGL"
                         caption="Port Data Direction Toggle"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="OUT"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Data Output Value">
               <bitfield name="OUT" caption="Port Data Output Value" mask="0xFFFFFFFF"/>
            </register>
            <register name="OUTCLR"
                      offset="0x14"
                      rw="RW"
                      size="4"
                      atomic-op="clear:OUT"
                      initval="0x00000000"
                      caption="Data Output Value Clear">
               <bitfield name="OUTCLR"
                         caption="Port Data Output Value Clear"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="OUTSET"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      atomic-op="set:OUT"
                      initval="0x00000000"
                      caption="Data Output Value Set">
               <bitfield name="OUTSET"
                         caption="Port Data Output Value Set"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="OUTTGL"
                      offset="0x1C"
                      rw="RW"
                      size="4"
                      atomic-op="toggle:OUT"
                      initval="0x00000000"
                      caption="Data Output Value Toggle">
               <bitfield name="OUTTGL"
                         caption="Port Data Output Value Toggle"
                         mask="0xFFFFFFFF"/>
            </register>
            <register name="IN"
                      offset="0x20"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Data Input Value">
               <bitfield name="IN" caption="Port Data Input Value" mask="0xFFFFFFFF"/>
            </register>
