Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="CTRL"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Control">
               <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
            </register>
            <register name="WRCONFIG"
                      offset="0x28"
                      rw="W"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Write Configuration">
               <bitfield name="PINMASK"
                         caption="Pin Mask for Multiple Pin Configuration"
                         mask="0xFFFF"/>
               <bitfield name="PMUXEN"
                         caption="Peripheral Multiplexer Enable"
                         mask="0x10000"/>
               <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
               <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
               <bitfield name="DRVSTR"
                         caption="Output Driver Strength Selection"
                         mask="0x400000"/>
               <bitfield name="PMUX" caption="Peripheral Multiplexing" mask="0xF000000"/>
               <bitfield name="WRPMUX" caption="Write PMUX" mask="0x10000000"/>
               <bitfield name="WRPINCFG" caption="Write PINCFG" mask="0x40000000"/>
               <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
            </register>
            <register name="PMUX"
                      offset="0x30"
                      rw="RW"
                      size="1"
                      count="16"
                      initval="0x00"
                      caption="Peripheral Multiplexing n">
               <bitfield name="PMUXE"
                         caption="Peripheral Multiplexing Even"
                         mask="0xF"
                         values="PORT_PMUX__PMUXE"/>
               <bitfield name="PMUXO"
                         caption="Peripheral Multiplexing Odd"
                         mask="0xF0"
                         values="PORT_PMUX__PMUXO"/>
            </register>
            <register name="PINCFG"
                      offset="0x40"
                      rw="RW"
                      size="1"
                      count="32"
                      initval="0x00"
                      caption="Pin Configuration n">
               <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x1"/>
               <bitfield name="INEN" caption="Input Enable" mask="0x2"/>
               <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
               <bitfield name="DRVSTR"
                         caption="Output Driver Strength Selection"
                         mask="0x40"/>
            </register>
         </register-group>
         <register-group name="PORT" caption="Port Module">
            <register-group name="GROUP"
                            name-in-module="GROUP"
                            offset="0x00"
                            size="0x80"
                            count="2"/>
         </register-group>
         <value-group name="PORT_PMUX__PMUXE">
            <value name="A" caption="Peripheral function A selected" value="0x0"/>
            <value name="B" caption="Peripheral function B selected" value="0x1"/>
            <value name="C" caption="Peripheral function C selected" value="0x2"/>
            <value name="D" caption="Peripheral function D selected" value="0x3"/>
            <value name="E" caption="Peripheral function E selected" value="0x4"/>
            <value name="F" caption="Peripheral function F selected" value="0x5"/>
            <value name="G" caption="Peripheral function G selected" value="0x6"/>
            <value name="H" caption="Peripheral function H selected" value="0x7"/>
         </value-group>
         <value-group name="PORT_PMUX__PMUXO">
            <value name="A" caption="Peripheral function A selected" value="0x0"/>
            <value name="B" caption="Peripheral function B selected" value="0x1"/>
            <value name="C" caption="Peripheral function C selected" value="0x2"/>
            <value name="D" caption="Peripheral function D selected" value="0x3"/>
            <value name="E" caption="Peripheral function E selected" value="0x4"/>
            <value name="F" caption="Peripheral function F selected" value="0x5"/>
            <value name="G" caption="Peripheral function G selected" value="0x6"/>
            <value name="H" caption="Peripheral function H selected" value="0x7"/>
         </value-group>
      </module>
      <module name="PTC"
              id="U2215"
              version="1.0.4"
              caption="Peripheral Touch Controller">
         <register-group name="PTC" caption="Peripheral Touch Controller"/>
      </module>
      <module name="RTC"
              id="U2202"
              version="1.0.1"
              caption="Real-Time Counter">
         <register-group name="RTC" caption="Real-Time Counter">
            <mode name="MODE0"
                  qualifier="RTC.MODE0.CTRL.MODE"
                  value="0"
                  caption="32-bit Counter with Single 32-bit Compare"/>
            <mode name="MODE1"
                  qualifier="RTC.MODE1.CTRL.MODE"
                  value="1"
                  caption="16-bit Counter with Two 16-bit Compares"/>
            <mode name="MODE2"
                  qualifier="RTC.MODE2.CTRL.MODE"
                  value="2"
                  caption="Clock/Calendar with Alarm"/>
            <register modes="MODE0"
                      name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE0 Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0xC"
                         values="RTC_MODE0_CTRL__MODE"/>
               <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0xF00"
                         values="RTC_MODE0_CTRL__PRESCALER"/>
            </register>
            <register modes="MODE1"
                      name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0xC"
                         values="RTC_MODE1_CTRL__MODE"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0xF00"
                         values="RTC_MODE1_CTRL__PRESCALER"/>
            </register>
            <register modes="MODE2"
                      name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE2 Control">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="Operating Mode"
                         mask="0xC"
                         values="RTC_MODE2_CTRL__MODE"/>
               <bitfield name="CLKREP" caption="Clock Representation" mask="0x40"/>
               <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0xF00"
                         values="RTC_MODE2_CTRL__PRESCALER"/>
            </register>
            <register name="READREQ"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0010"
                      caption="Read Request">
               <bitfield name="ADDR" caption="Address" mask="0x3F"/>
               <bitfield name="RCONT" caption="Read Continuously" mask="0x4000"/>
               <bitfield name="RREQ" caption="Read Request" mask="0x8000"/>
            </register>
            <register modes="MODE0"
                      name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="MODE0 Event Control">
               <bitfield name="PEREO0"
                         caption="Periodic Interval 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="PEREO1"
                         caption="Periodic Interval 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="PEREO2"
                         caption="Periodic Interval 2 Event Output Enable"
                         mask="0x4"/>
               <bitfield name="PEREO3"
                         caption="Periodic Interval 3 Event Output Enable"
                         mask="0x8"/>
               <bitfield name="PEREO4"
                         caption="Periodic Interval 4 Event Output Enable"
                         mask="0x10"/>
               <bitfield name="PEREO5"
                         caption="Periodic Interval 5 Event Output Enable"
                         mask="0x20"/>
               <bitfield name="PEREO6"
                         caption="Periodic Interval 6 Event Output Enable"
                         mask="0x40"/>
               <bitfield name="PEREO7"
                         caption="Periodic Interval 7 Event Output Enable"
                         mask="0x80"/>
               <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
               <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
            </register>
            <register modes="MODE1"
                      name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Event Control">
               <bitfield name="PEREO0"
                         caption="Periodic Interval 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="PEREO1"
                         caption="Periodic Interval 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="PEREO2"
                         caption="Periodic Interval 2 Event Output Enable"
                         mask="0x4"/>
               <bitfield name="PEREO3"
                         caption="Periodic Interval 3 Event Output Enable"
                         mask="0x8"/>
               <bitfield name="PEREO4"
                         caption="Periodic Interval 4 Event Output Enable"
                         mask="0x10"/>
               <bitfield name="PEREO5"
                         caption="Periodic Interval 5 Event Output Enable"
                         mask="0x20"/>
               <bitfield name="PEREO6"
                         caption="Periodic Interval 6 Event Output Enable"
                         mask="0x40"/>
               <bitfield name="PEREO7"
                         caption="Periodic Interval 7 Event Output Enable"
                         mask="0x80"/>
               <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
               <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
               <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
            </register>
            <register modes="MODE2"
                      name="EVCTRL"
                      offset="0x4"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="MODE2 Event Control">
               <bitfield name="PEREO0"
                         caption="Periodic Interval 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="PEREO1"
                         caption="Periodic Interval 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="PEREO2"
                         caption="Periodic Interval 2 Event Output Enable"
                         mask="0x4"/>
               <bitfield name="PEREO3"
                         caption="Periodic Interval 3 Event Output Enable"
                         mask="0x8"/>
               <bitfield name="PEREO4"
                         caption="Periodic Interval 4 Event Output Enable"
                         mask="0x10"/>
               <bitfield name="PEREO5"
                         caption="Periodic Interval 5 Event Output Enable"
                         mask="0x20"/>
               <bitfield name="PEREO6"
                         caption="Periodic Interval 6 Event Output Enable"
                         mask="0x40"/>
               <bitfield name="PEREO7"
                         caption="Periodic Interval 7 Event Output Enable"
                         mask="0x80"/>
               <bitfield name="ALARMEO0" caption="Alarm 0 Event Output Enable" mask="0x100"/>
               <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
            </register>
            <register modes="MODE0"
                      name="INTENCLR"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="MODE0 Interrupt Enable Clear">
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="MODE1"
                      name="INTENCLR"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="MODE1 Interrupt Enable Clear">
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="MODE2"
                      name="INTENCLR"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="MODE2 Interrupt Enable Clear">
               <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="MODE0"
                      name="INTENSET"
                      offset="0x7"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="MODE0 Interrupt Enable Set">
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="MODE1"
                      name="INTENSET"
                      offset="0x7"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="MODE1 Interrupt Enable Set">
               <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x2"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="MODE2"
                      name="INTENSET"
                      offset="0x7"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="MODE2 Interrupt Enable Set">
               <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="SYNCRDY"
                         caption="Synchronization Ready Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
            </register>
            <register modes="MODE0"
                      name="INTFLAG"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="MODE0 Interrupt Flag Status and Clear">
               <bitfield name="CMP0" caption="Compare 0" mask="0x1"/>
               <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x40"/>
               <bitfield name="OVF" caption="Overflow" mask="0x80"/>
            </register>
            <register modes="MODE1"
                      name="INTFLAG"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="MODE1 Interrupt Flag Status and Clear">
               <bitfield name="CMP0" caption="Compare 0" mask="0x1"/>
               <bitfield name="CMP1" caption="Compare 1" mask="0x2"/>
               <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x40"/>
               <bitfield name="OVF" caption="Overflow" mask="0x80"/>
            </register>
            <register modes="MODE2"
                      name="INTFLAG"
                      offset="0x8"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="MODE2 Interrupt Flag Status and Clear">
               <bitfield name="ALARM0" caption="Alarm 0" mask="0x1"/>
               <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x40"/>
               <bitfield name="OVF" caption="Overflow" mask="0x80"/>
            </register>
            <register name="STATUS"
                      offset="0xA"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register name="DBGCTRL"
                      offset="0xB"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="Debug Control">
               <bitfield name="DBGRUN" caption="Run During Debug" mask="0x1"/>
            </register>
            <register name="FREQCORR"
                      offset="0xC"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Frequency Correction">
               <bitfield name="VALUE" caption="Correction Value" mask="0x7F"/>
               <bitfield name="SIGN" caption="Correction Sign" mask="0x80"/>
            </register>
            <register modes="MODE0"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      access="RWSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE0 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
            </register>
            <register modes="MODE1"
                      name="COUNT"
                      offset="0x10"
                      rw="RW"
                      access="RWSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Counter Value">
               <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
            </register>
            <register modes="MODE2"
                      name="CLOCK"
                      offset="0x10"
                      rw="RW"
                      access="RWSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE2 Clock Value">
               <bitfield name="SECOND" caption="Second" mask="0x3F"/>
               <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
               <bitfield name="HOUR"
                         caption="Hour"
                         mask="0x1F000"
                         values="RTC_MODE2_CLOCK__HOUR"/>
               <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
               <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
               <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
            </register>
            <register modes="MODE1"
                      name="PER"
                      offset="0x14"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="MODE1 Counter Period">
               <bitfield name="PER" caption="Counter Period" mask="0xFFFF"/>
            </register>
            <register modes="MODE0"
                      name="COMP"
                      offset="0x18"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="MODE0 Compare n Value">
               <bitfield name="COMP" caption="Compare Value" mask="0xFFFFFFFF"/>
            </register>
            <register modes="MODE1"
                      name="COMP"
                      offset="0x18"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      count="2"
                      initval="0x0000"
                      caption="MODE1 Compare n Value">
               <bitfield name="COMP" caption="Compare Value" mask="0xFFFF"/>
            </register>
