Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register modes="I2CM"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="I2CM Baud Rate">
               <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
               <bitfield name="BAUDLOW" caption="Baud Rate Value Low" mask="0xFF00"/>
               <bitfield name="HSBAUD" caption="High Speed Baud Rate Value" mask="0xFF0000"/>
               <bitfield name="HSBAUDLOW"
                         caption="High Speed Baud Rate Value Low"
                         mask="0xFF000000"/>
            </register>
            <register modes="SPIM"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIM Baud Rate">
               <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
            </register>
            <register modes="SPIS"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="SPIS Baud Rate">
               <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
            </register>
            <register modes="USART_EXT"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_EXT Baud Rate">
               <mode name="DEFAULT"/>
               <mode name="FRAC"/>
               <mode name="FRACFP"/>
               <mode name="USARTFP"/>
               <bitfield modes="FRAC FRACFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0x1FFF"/>
               <bitfield modes="FRAC FRACFP"
                         name="FP"
                         caption="Fractional Part"
                         mask="0xE000"/>
               <bitfield modes="DEFAULT USARTFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0xFFFF"/>
            </register>
            <register modes="USART_INT"
                      name="BAUD"
                      offset="0xC"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="USART_INT Baud Rate">
               <mode name="DEFAULT"/>
               <mode name="FRAC"/>
               <mode name="FRACFP"/>
               <mode name="USARTFP"/>
               <bitfield modes="FRAC FRACFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0x1FFF"/>
               <bitfield modes="FRAC FRACFP"
                         name="FP"
                         caption="Fractional Part"
                         mask="0xE000"/>
               <bitfield modes="DEFAULT USARTFP"
                         name="BAUD"
                         caption="Baud Rate Value"
                         mask="0xFFFF"/>
            </register>
            <register modes="USART_EXT"
                      name="RXPL"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="USART_EXT Receive Pulse Length">
               <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
            </register>
            <register modes="USART_INT"
                      name="RXPL"
                      offset="0xE"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="USART_INT Receive Pulse Length">
               <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
            </register>
            <register modes="I2CM"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="I2CM Interrupt Enable Clear">
               <bitfield name="MB" caption="Master On Bus Interrupt Disable" mask="0x1"/>
               <bitfield name="SB" caption="Slave On Bus Interrupt Disable" mask="0x2"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="I2CS"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="I2CS Interrupt Enable Clear">
               <bitfield name="PREC" caption="Stop Received Interrupt Disable" mask="0x1"/>
               <bitfield name="AMATCH" caption="Address Match Interrupt Disable" mask="0x2"/>
               <bitfield name="DRDY" caption="Data Interrupt Disable" mask="0x4"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="SPIM"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="SPIM Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Disable" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="SPIS"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="SPIS Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="SSL" caption="Slave Select Low Interrupt Disable" mask="0x8"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="USART_EXT"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="USART_EXT Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt Disable"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt Disable" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
            <register modes="USART_INT"
                      name="INTENCLR"
                      offset="0x14"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="USART_INT Interrupt Enable Clear">
               <bitfield name="DRE"
                         caption="Data Register Empty Interrupt Disable"
                         mask="0x1"/>
               <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
               <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
               <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
               <bitfield name="CTSIC"
                         caption="Clear To Send Input Change Interrupt Disable"
                         mask="0x10"/>
               <bitfield name="RXBRK" caption="Break Received Interrupt Disable" mask="0x20"/>
               <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
            </register>
