Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
         <value-group name="SERCOM_SPIM_CTRLA__CPOL">
            <value name="IDLE_LOW" caption="SCK is low when idle" value="0x0"/>
            <value name="IDLE_HIGH" caption="SCK is high when idle" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__DORD">
            <value name="MSB" caption="MSB is transferred first" value="0x0"/>
            <value name="LSB" caption="LSB is transferred first" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__DOPO">
            <value name="PAD0"
                   caption="DO on PAD[0], SCK on PAD[1] and SS on PAD[2]"
                   value="0x0"/>
            <value name="PAD1"
                   caption="DO on PAD[2], SCK on PAD[3] and SS on PAD[1]"
                   value="0x1"/>
            <value name="PAD2"
                   caption="DO on PAD[3], SCK on PAD[1] and SS on PAD[2]"
                   value="0x2"/>
            <value name="PAD3"
                   caption="DO on PAD[0], SCK on PAD[3] and SS on PAD[1]"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__DIPO">
            <value name="PAD0" caption="SERCOM PAD[0]" value="0x0"/>
            <value name="PAD1" caption="SERCOM PAD[1]" value="0x1"/>
            <value name="PAD2" caption="SERCOM PAD[2]" value="0x2"/>
            <value name="PAD3" caption="SERCOM PAD[3]" value="0x3"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLA__FORM">
            <value name="SPI_FRAME" caption="SPI Frame" value="0x0"/>
            <value name="SPI_FRAME_WITH_ADDR"
                   caption="SPI Frame with Addr"
                   value="0x2"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLB__CHSIZE">
            <value name="8_BIT" caption="8 bits" value="0x0"/>
            <value name="9_BIT" caption="9 bits" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_SPIM_CTRLB__AMODE">
            <value name="MASK" caption="SPI Address mask " value="0x0"/>
            <value name="2_ADDRESSES" caption="Two unique Addressess" value="0x1"/>
            <value name="RANGE" caption="Address Range" value="0x2"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__MODE">
            <value name="USART_EXT_CLK"
                   caption="USART with external clock"
                   value="0x0"/>
            <value name="USART_INT_CLK"
                   caption="USART with internal clock"
                   value="0x1"/>
            <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
            <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
            <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
            <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__CMODE">
            <value name="ASYNC" caption="Asynchronous Communication" value="0x0"/>
            <value name="SYNC" caption="Synchronous Communication" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__CPOL">
            <value name="IDLE_LOW"
                   caption="TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge"
                   value="0x0"/>
            <value name="IDLE_HIGH"
                   caption="TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge"
                   value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__DORD">
            <value name="MSB" caption="MSB is transmitted first" value="0x0"/>
            <value name="LSB" caption="LSB is transmitted first" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__FORM">
            <value name="USART_FRAME_NO_PARITY" caption="USART frame" value="0x0"/>
            <value name="USART_FRAME_WITH_PARITY"
                   caption="USART frame with parity"
                   value="0x1"/>
            <value name="USART_FRAME_AUTO_BAUD_NO_PARITY"
                   caption="Auto-baud - break detection and auto-baud"
                   value="0x4"/>
            <value name="USART_FRAME_AUTO_BAUD_WITH_PARITY"
                   caption="Auto-baud - break detection and auto-baud with parity"
                   value="0x5"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__RXPO">
            <value name="PAD0"
                   caption="SERCOM PAD[0] is used for data reception"
                   value="0x0"/>
            <value name="PAD1"
                   caption="SERCOM PAD[1] is used for data reception"
                   value="0x1"/>
            <value name="PAD2"
                   caption="SERCOM PAD[2] is used for data reception"
                   value="0x2"/>
            <value name="PAD3"
                   caption="SERCOM PAD[3] is used for data reception"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__TXPO">
            <value name="PAD0" caption="PAD[0] = TxD; PAD[1] = XCK" value="0x0"/>
            <value name="PAD1" caption="PAD[2] = TxD; PAD[3] = XCK" value="0x1"/>
            <value name="PAD2"
                   caption="PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS"
                   value="0x2"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLA__SAMPR">
            <value name="16X_ARITHMETIC"
                   caption="16x over-sampling using arithmetic baudrate generation"
                   value="0x0"/>
            <value name="16X_FRACTIONAL"
                   caption="16x over-sampling using fractional baudrate generation"
                   value="0x1"/>
            <value name="8X_ARITHMETIC"
                   caption="8x over-sampling using arithmetic baudrate generation"
                   value="0x2"/>
            <value name="8X_FRACTIONAL"
                   caption="8x over-sampling using fractional baudrate generation"
                   value="0x3"/>
            <value name="3X_ARITHMETIC"
                   caption="3x over-sampling using arithmetic baudrate generation"
                   value="0x4"/>
         </value-group>
