Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
         <value-group name="SERCOM_USART_CTRLA__SAMPA">
            <value name="ADJ0"
                   caption="16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5"
                   value="0x0"/>
            <value name="ADJ1"
                   caption="16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6"
                   value="0x1"/>
            <value name="ADJ2"
                   caption="16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7"
                   value="0x2"/>
            <value name="ADJ3"
                   caption="16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8"
                   value="0x3"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__CHSIZE">
            <value name="8_BIT" caption="8 Bits" value="0x0"/>
            <value name="9_BIT" caption="9 Bits" value="0x1"/>
            <value name="5_BIT" caption="5 Bits" value="0x5"/>
            <value name="6_BIT" caption="6 Bits" value="0x6"/>
            <value name="7_BIT" caption="7 Bits" value="0x7"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__PMODE">
            <value name="EVEN" caption="Even Parity" value="0x0"/>
            <value name="ODD" caption="Odd Parity" value="0x1"/>
         </value-group>
         <value-group name="SERCOM_USART_CTRLB__SBMODE">
            <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
            <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
         </value-group>
      </module>
      <module name="SYSCTRL"
              id="U2100"
              version="2.0.1"
              caption="System Control">
         <register-group name="SYSCTRL" caption="System Control">
            <register name="INTENCLR"
                      offset="0x0"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
               <bitfield name="XOSC32KRDY"
                         caption="XOSC32K Ready Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready Interrupt Enable" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x10"/>
               <bitfield name="DFLLOOB"
                         caption="DFLL Out Of Bounds Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="DFLLLCKF"
                         caption="DFLL Lock Fine Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="DFLLLCKC"
                         caption="DFLL Lock Coarse Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="DFLLRCS"
                         caption="DFLL Reference Clock Stopped Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready Interrupt Enable" mask="0x200"/>
               <bitfield name="BOD33DET"
                         caption="BOD33 Detection Interrupt Enable"
                         mask="0x400"/>
               <bitfield name="B33SRDY"
                         caption="BOD33 Synchronization Ready Interrupt Enable"
                         mask="0x800"/>
               <bitfield name="DPLLLCKR"
                         caption="DPLL Lock Rise Interrupt Enable"
                         mask="0x8000"/>
               <bitfield name="DPLLLCKF"
                         caption="DPLL Lock Fall Interrupt Enable"
                         mask="0x10000"/>
               <bitfield name="DPLLLTO"
                         caption="DPLL Lock Timeout Interrupt Enable"
                         mask="0x20000"/>
            </register>
            <register name="INTENSET"
                      offset="0x4"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
               <bitfield name="XOSC32KRDY"
                         caption="XOSC32K Ready Interrupt Enable"
                         mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready Interrupt Enable" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x10"/>
               <bitfield name="DFLLOOB"
                         caption="DFLL Out Of Bounds Interrupt Enable"
                         mask="0x20"/>
               <bitfield name="DFLLLCKF"
                         caption="DFLL Lock Fine Interrupt Enable"
                         mask="0x40"/>
               <bitfield name="DFLLLCKC"
                         caption="DFLL Lock Coarse Interrupt Enable"
                         mask="0x80"/>
               <bitfield name="DFLLRCS"
                         caption="DFLL Reference Clock Stopped Interrupt Enable"
                         mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready Interrupt Enable" mask="0x200"/>
               <bitfield name="BOD33DET"
                         caption="BOD33 Detection Interrupt Enable"
                         mask="0x400"/>
               <bitfield name="B33SRDY"
                         caption="BOD33 Synchronization Ready Interrupt Enable"
                         mask="0x800"/>
               <bitfield name="DPLLLCKR"
                         caption="DPLL Lock Rise Interrupt Enable"
                         mask="0x8000"/>
               <bitfield name="DPLLLCKF"
                         caption="DPLL Lock Fall Interrupt Enable"
                         mask="0x10000"/>
               <bitfield name="DPLLLTO"
                         caption="DPLL Lock Timeout Interrupt Enable"
                         mask="0x20000"/>
            </register>
            <register name="INTFLAG"
                      offset="0x8"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
               <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
               <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
               <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
               <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
               <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x8000"/>
               <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x10000"/>
               <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x20000"/>
            </register>
            <register name="PCLKSR"
                      offset="0xC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Power and Clocks Status">
               <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
               <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x2"/>
               <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x4"/>
               <bitfield name="OSC8MRDY" caption="OSC8M Ready" mask="0x8"/>
               <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x10"/>
               <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x20"/>
               <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x40"/>
               <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x80"/>
               <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x100"/>
               <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x200"/>
               <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x400"/>
               <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x800"/>
               <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x8000"/>
               <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x10000"/>
               <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x20000"/>
            </register>
            <register name="XOSC"
                      offset="0x10"
                      rw="RW"
                      size="2"
                      initval="0x0080"
                      caption="External Multipurpose Crystal Oscillator (XOSC) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="GAIN"
                         caption="Oscillator Gain"
                         mask="0x700"
                         values="SYSCTRL_XOSC__GAIN"/>
               <bitfield name="AMPGC"
                         caption="Automatic Amplitude Gain Control"
                         mask="0x800"/>
               <bitfield name="STARTUP"
                         caption="Start-Up Time"
                         mask="0xF000"
                         values="SYSCTRL_XOSC__STARTUP"/>
            </register>
            <register name="XOSC32K"
                      offset="0x14"
                      rw="RW"
                      size="2"
                      initval="0x0080"
                      caption="32kHz External Crystal Oscillator (XOSC32K) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
               <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
               <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
               <bitfield name="AAMPEN"
                         caption="Automatic Amplitude Control Enable"
                         mask="0x20"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="STARTUP"
                         caption="Oscillator Start-Up Time"
                         mask="0x700"
                         values="SYSCTRL_XOSC32K__STARTUP"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
            </register>
            <register name="OSC32K"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      initval="0x003F0080"
                      caption="32kHz Internal Oscillator (OSC32K) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
               <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="STARTUP"
                         caption="Oscillator Start-Up Time"
                         mask="0x700"
                         values="SYSCTRL_OSC32K__STARTUP"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
               <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x7F0000"/>
            </register>
            <register name="OSCULP32K"
                      offset="0x1C"
                      rw="RW"
                      size="1"
                      initval="0x1F"
                      caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
               <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x1F"/>
               <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
            </register>
            <register name="OSC8M"
                      offset="0x20"
                      rw="RW"
                      size="4"
                      initval="0x87070382"
                      caption="8MHz Internal Oscillator (OSC8M) Control">
               <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="PRESC"
                         caption="Oscillator Prescaler"
                         mask="0x300"
                         values="SYSCTRL_OSC8M__PRESC"/>
               <bitfield name="CALIB" caption="Oscillator Calibration" mask="0xFFF0000"/>
               <bitfield name="FRANGE"
                         caption="Oscillator Frequency Range"
                         mask="0xC0000000"
                         values="SYSCTRL_OSC8M__FRANGE"/>
            </register>
            <register name="DFLLCTRL"
                      offset="0x24"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0080"
                      caption="DFLL48M Control">
               <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2"/>
               <bitfield name="MODE" caption="Operating Mode Selection" mask="0x4"/>
               <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x8"/>
               <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
               <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
               <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
               <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x400"/>
               <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x800"/>
            </register>
