Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="DFLLVAL"
                      offset="0x28"
                      rw="RW"
                      access="RSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="DFLL48M Value">
               <bitfield name="FINE" caption="Fine Value" mask="0x3FF"/>
               <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
               <bitfield name="DIFF"
                         caption="Multiplication Ratio Difference"
                         mask="0xFFFF0000"/>
            </register>
            <register name="DFLLMUL"
                      offset="0x2C"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="DFLL48M Multiplier">
               <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
               <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0x3FF0000"/>
               <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
            </register>
            <register name="DFLLSYNC"
                      offset="0x30"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="DFLL48M Synchronization">
               <bitfield name="READREQ" caption="Read Request" mask="0x80"/>
            </register>
            <register name="BOD33"
                      offset="0x34"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="3.3V Brown-Out Detector (BOD33) Control">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="HYST" caption="Hysteresis" mask="0x4"/>
               <bitfield name="ACTION"
                         caption="BOD33 Action"
                         mask="0x18"
                         values="SYSCTRL_BOD33__ACTION"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="MODE" caption="Operation Mode" mask="0x100"/>
               <bitfield name="CEN" caption="Clock Enable" mask="0x200"/>
               <bitfield name="PSEL"
                         caption="Prescaler Select"
                         mask="0xF000"
                         values="SYSCTRL_BOD33__PSEL"/>
               <bitfield name="LEVEL" caption="BOD33 Threshold Level" mask="0x3F0000"/>
            </register>
            <register name="VREG"
                      offset="0x3C"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Voltage Regulator System (VREG) Control">
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="FORCELDO" caption="Force LDO Voltage Regulator" mask="0x2000"/>
            </register>
            <register name="VREF"
                      offset="0x40"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Voltage References System (VREF) Control">
               <bitfield name="TSEN" caption="Temperature Sensor Enable" mask="0x2"/>
               <bitfield name="BGOUTEN" caption="Bandgap Output Enable" mask="0x4"/>
               <bitfield name="CALIB"
                         caption="Bandgap Voltage Generator Calibration"
                         mask="0x7FF0000"/>
            </register>
            <register name="DPLLCTRLA"
                      offset="0x44"
                      rw="RW"
                      size="1"
                      initval="0x80"
                      caption="DPLL Control A">
               <bitfield name="ENABLE" caption="DPLL Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
               <bitfield name="ONDEMAND" caption="On Demand Clock Activation" mask="0x80"/>
            </register>
            <register name="DPLLRATIO"
                      offset="0x48"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="DPLL Ratio Control">
               <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
               <bitfield name="LDRFRAC"
                         caption="Loop Divider Ratio Fractional Part"
                         mask="0xF0000"/>
            </register>
            <register name="DPLLCTRLB"
                      offset="0x4C"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="DPLL Control B">
               <bitfield name="FILTER"
                         caption="Proportional Integral Filter Selection"
                         mask="0x3"
                         values="SYSCTRL_DPLLCTRLB__FILTER"/>
               <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
               <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
               <bitfield name="REFCLK"
                         caption="Reference Clock Selection"
                         mask="0x30"
                         values="SYSCTRL_DPLLCTRLB__REFCLK"/>
               <bitfield name="LTIME"
                         caption="Lock Time"
                         mask="0x700"
                         values="SYSCTRL_DPLLCTRLB__LTIME"/>
               <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
               <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
            </register>
            <register name="DPLLSTATUS"
                      offset="0x50"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="DPLL Status">
               <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
               <bitfield name="CLKRDY" caption="Output Clock Ready" mask="0x2"/>
               <bitfield name="ENABLE" caption="DPLL Enable" mask="0x4"/>
               <bitfield name="DIV" caption="Divider Enable" mask="0x8"/>
            </register>
         </register-group>
