Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
         <value-group name="SYSCTRL_XOSC__GAIN">
            <value name="0" caption="2MHz" value="0x0"/>
            <value name="1" caption="4MHz" value="0x1"/>
            <value name="2" caption="8MHz" value="0x2"/>
            <value name="3" caption="16MHz" value="0x3"/>
            <value name="4" caption="30MHz" value="0x4"/>
         </value-group>
         <value-group name="SYSCTRL_OSC8M__FRANGE">
            <value name="0" caption="4 to 6MHz" value="0x0"/>
            <value name="1" caption="6 to 8MHz" value="0x1"/>
            <value name="2" caption="8 to 11MHz" value="0x2"/>
            <value name="3" caption="11 to 15MHz" value="0x3"/>
         </value-group>
         <value-group name="SYSCTRL_OSC8M__PRESC">
            <value name="0" caption="1" value="0x0"/>
            <value name="1" caption="2" value="0x1"/>
            <value name="2" caption="4" value="0x2"/>
            <value name="3" caption="8" value="0x3"/>
         </value-group>
         <value-group name="SYSCTRL_XOSC__STARTUP">
            <value name="CYCLE1" caption="31 us" value="0"/>
            <value name="CYCLE2" caption="61 us" value="1"/>
            <value name="CYCLE4" caption="122 us" value="2"/>
            <value name="CYCLE8" caption="244 us" value="3"/>
            <value name="CYCLE16" caption="488 us" value="4"/>
            <value name="CYCLE32" caption="977 us" value="5"/>
            <value name="CYCLE64" caption="1953 us" value="6"/>
            <value name="CYCLE128" caption="3906 us" value="7"/>
            <value name="CYCLE256" caption="7813 us" value="8"/>
            <value name="CYCLE512" caption="15625 us" value="9"/>
            <value name="CYCLE1024" caption="31250 us" value="10"/>
            <value name="CYCLE2048" caption="62500 us" value="11"/>
            <value name="CYCLE4096" caption="125000 us" value="12"/>
            <value name="CYCLE8192" caption="250000 us" value="13"/>
            <value name="CYCLE16384" caption="500000 us" value="14"/>
            <value name="CYCLE32768" caption="1000000 us" value="15"/>
         </value-group>
         <value-group name="SYSCTRL_OSC32K__STARTUP">
            <value name="CYCLE3" caption="0.092 ms" value="0"/>
            <value name="CYCLE4" caption="0.122 ms" value="1"/>
            <value name="CYCLE6" caption="0.183 ms" value="2"/>
            <value name="CYCLE10" caption="0.305 ms" value="3"/>
            <value name="CYCLE18" caption="0.549 ms" value="4"/>
            <value name="CYCLE34" caption="1.038 ms" value="5"/>
            <value name="CYCLE66" caption="2.014 ms" value="6"/>
            <value name="CYCLE130" caption="3.967 ms" value="7"/>
         </value-group>
         <value-group name="SYSCTRL_XOSC32K__STARTUP">
            <value name="CYCLE1" caption="0.122 ms" value="0"/>
            <value name="CYCLE32" caption="1.068 ms" value="1"/>
            <value name="CYCLE2048" caption="62.592 ms" value="2"/>
            <value name="CYCLE4096" caption="125.092 ms" value="3"/>
            <value name="CYCLE16384" caption="500.092 ms" value="4"/>
            <value name="CYCLE32768" caption="1000.092 ms" value="5"/>
            <value name="CYCLE65536" caption="2000.092 ms" value="6"/>
            <value name="CYCLE131072" caption="4000.092 ms" value="7"/>
         </value-group>
         <value-group name="SYSCTRL_BOD33__ACTION">
            <value name="NONE" caption="No action" value="0x0"/>
            <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
            <value name="INTERRUPT"
                   caption="The BOD33 generates an interrupt"
                   value="0x2"/>
         </value-group>
         <value-group name="SYSCTRL_BOD33__PSEL">
            <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
            <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
            <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
            <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
            <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
            <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
            <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
            <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
            <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
            <value name="DIV1K" caption="Divide clock by 1024" value="0x9"/>
            <value name="DIV2K" caption="Divide clock by 2048" value="0xA"/>
            <value name="DIV4K" caption="Divide clock by 4096" value="0xB"/>
            <value name="DIV8K" caption="Divide clock by 8192" value="0xC"/>
            <value name="DIV16K" caption="Divide clock by 16384" value="0xD"/>
            <value name="DIV32K" caption="Divide clock by 32768" value="0xE"/>
            <value name="DIV64K" caption="Divide clock by 65536" value="0xF"/>
         </value-group>
         <value-group name="SYSCTRL_DPLLCTRLB__FILTER">
            <value name="DEFAULT" caption="Default filter mode" value="0x0"/>
            <value name="LBFILT" caption="Low bandwidth filter" value="0x1"/>
            <value name="HBFILT" caption="High bandwidth filter" value="0x2"/>
            <value name="HDFILT" caption="High damping filter" value="0x3"/>
         </value-group>
         <value-group name="SYSCTRL_DPLLCTRLB__LTIME">
            <value name="DEFAULT" caption="No time-out" value="0x0"/>
            <value name="8MS" caption="Time-out if no lock within 8 ms" value="0x4"/>
            <value name="9MS" caption="Time-out if no lock within 9 ms" value="0x5"/>
            <value name="10MS" caption="Time-out if no lock within 10 ms" value="0x6"/>
            <value name="11MS" caption="Time-out if no lock within 11 ms" value="0x7"/>
         </value-group>
         <value-group name="SYSCTRL_DPLLCTRLB__REFCLK">
            <value name="REF0" caption="CLK_DPLL_REF0 clock reference" value="0x0"/>
            <value name="REF1" caption="CLK_DPLL_REF1 clock reference" value="0x1"/>
            <value name="GCLK" caption="GCLK_DPLL clock reference" value="0x2"/>
         </value-group>
      </module>
      <module name="TC"
              id="U2212"
              version="1.3.1"
              caption="Basic Timer Counter">
         <register-group name="TC" caption="Basic Timer Counter">
            <mode name="COUNT8"
                  qualifier="TC.CTRLA.MODE"
                  value="1"
                  caption="8-bit Counter Mode"/>
            <mode name="COUNT16"
                  qualifier="TC.CTRLA.MODE"
                  value="0"
                  caption="16-bit Counter Mode"/>
            <mode name="COUNT32"
                  qualifier="TC.CTRLA.MODE"
                  value="2"
                  caption="32-bit Counter Mode"/>
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="MODE"
                         caption="TC Mode"
                         mask="0xC"
                         values="TC_CTRLA__MODE"/>
               <bitfield name="WAVEGEN"
                         caption="Waveform Generation Operation"
                         mask="0x60"
                         values="TC_CTRLA__WAVEGEN"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0x700"
                         values="TC_CTRLA__PRESCALER"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
               <bitfield name="PRESCSYNC"
                         caption="Prescaler and Counter Synchronization"
                         mask="0x3000"
                         values="TC_CTRLA__PRESCSYNC"/>
            </register>
            <register name="READREQ"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Read Request">
               <bitfield name="ADDR" caption="Address" mask="0x1F"/>
               <bitfield name="RCONT" caption="Read Continuously" mask="0x4000"/>
               <bitfield name="RREQ" caption="Read Request" mask="0x8000"/>
            </register>
            <register name="CTRLBCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:CTRLBCLR"
                      initval="0x02"
                      caption="Control B Clear">
               <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
               <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
               <bitfield name="CMD"
                         caption="Command"
                         mask="0xC0"
                         values="TC_CTRLBCLR__CMD"/>
            </register>
