Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register modes="COUNT16"
                      name="CC"
                      offset="0x18"
                      rw="RW"
                      size="2"
                      count="2"
                      initval="0x0000"
                      caption="COUNT16 Compare/Capture">
               <bitfield name="CC" caption="Compare/Capture Value" mask="0xFFFF"/>
            </register>
            <register modes="COUNT32"
                      name="CC"
                      offset="0x18"
                      rw="RW"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="COUNT32 Compare/Capture">
               <bitfield name="CC" caption="Compare/Capture Value" mask="0xFFFFFFFF"/>
            </register>
         </register-group>
         <value-group name="TC_CTRLA__MODE">
            <value name="COUNT16" caption="Counter in 16-bit mode" value="0"/>
            <value name="COUNT8" caption="Counter in 8-bit mode" value="1"/>
            <value name="COUNT32" caption="Counter in 32-bit mode" value="2"/>
         </value-group>
         <value-group name="TC_CTRLA__PRESCALER">
            <value name="DIV1" caption="Prescaler: GCLK_TC" value="0x0"/>
            <value name="DIV2" caption="Prescaler: GCLK_TC/2" value="0x1"/>
            <value name="DIV4" caption="Prescaler: GCLK_TC/4" value="0x2"/>
            <value name="DIV8" caption="Prescaler: GCLK_TC/8" value="0x3"/>
            <value name="DIV16" caption="Prescaler: GCLK_TC/16" value="0x4"/>
            <value name="DIV64" caption="Prescaler: GCLK_TC/64" value="0x5"/>
            <value name="DIV256" caption="Prescaler: GCLK_TC/256" value="0x6"/>
            <value name="DIV1024" caption="Prescaler: GCLK_TC/1024" value="0x7"/>
         </value-group>
         <value-group name="TC_CTRLA__PRESCSYNC">
            <value name="GCLK"
                   caption="Reload or reset the counter on next generic clock"
                   value="0"/>
            <value name="PRESC"
                   caption="Reload or reset the counter on next prescaler clock"
                   value="1"/>
            <value name="RESYNC"
                   caption="Reload or reset the counter on next generic clock. Reset the prescaler counter"
                   value="2"/>
         </value-group>
         <value-group name="TC_CTRLA__WAVEGEN">
            <value name="NFRQ" value="0"/>
            <value name="MFRQ" value="1"/>
            <value name="NPWM" value="2"/>
            <value name="MPWM" value="3"/>
         </value-group>
         <value-group name="TC_CTRLBCLR__CMD">
            <value name="NONE" caption="No action" value="0"/>
            <value name="RETRIGGER"
                   caption="Force a start, restart or retrigger"
                   value="1"/>
            <value name="STOP" caption="Force a stop" value="2"/>
         </value-group>
         <value-group name="TC_CTRLBSET__CMD">
            <value name="NONE" caption="No action" value="0x0"/>
            <value name="RETRIGGER"
                   caption="Force a start, restart or retrigger"
                   value="0x1"/>
            <value name="STOP" caption="Force a stop" value="0x2"/>
         </value-group>
         <value-group name="TC_EVCTRL__EVACT">
            <value name="OFF" caption="Event action disabled" value="0"/>
            <value name="RETRIGGER"
                   caption="Start, restart or retrigger TC on event"
                   value="1"/>
            <value name="COUNT" caption="Count on event" value="2"/>
            <value name="START" caption="Start TC on event" value="3"/>
            <value name="PPW"
                   caption="Period captured in CC0, pulse width in CC1"
                   value="5"/>
            <value name="PWP"
                   caption="Period captured in CC1, pulse width in CC0"
                   value="6"/>
         </value-group>
      </module>
      <module name="TCC"
              id="U2213"
              version="1.2.2"
              caption="Timer Counter Control">
         <register-group name="TCC" caption="Timer Counter Control">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="RESOLUTION"
                         caption="Enhanced Resolution"
                         mask="0x60"
                         values="TCC_CTRLA__RESOLUTION"/>
               <bitfield name="PRESCALER"
                         caption="Prescaler"
                         mask="0x700"
                         values="TCC_CTRLA__PRESCALER"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
               <bitfield name="PRESCSYNC"
                         caption="Prescaler and Counter Synchronization Selection"
                         mask="0x3000"
                         values="TCC_CTRLA__PRESCSYNC"/>
               <bitfield name="ALOCK" caption="Auto Lock" mask="0x4000"/>
               <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x1000000"/>
               <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x2000000"/>
               <bitfield name="CPTEN2" caption="Capture Channel 2 Enable" mask="0x4000000"/>
               <bitfield name="CPTEN3" caption="Capture Channel 3 Enable" mask="0x8000000"/>
            </register>
            <register name="CTRLBCLR"
                      offset="0x4"
                      rw="RW"
                      access="RWSYNC"
                      size="1"
                      atomic-op="clear:CTRLBCLR"
                      initval="0x00"
                      caption="Control B Clear">
               <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
               <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
               <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
               <bitfield name="IDXCMD"
                         caption="Ramp Index Command"
                         mask="0x18"
                         values="TCC_CTRLBCLR__IDXCMD"/>
               <bitfield name="CMD"
                         caption="TCC Command"
                         mask="0xE0"
                         values="TCC_CTRLBCLR__CMD"/>
            </register>
