Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="INTENCLR"
                      offset="0x24"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTENCLR"
                      initval="0x00000000"
                      caption="Interrupt Enable Clear">
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
               <bitfield name="TRG" caption="Retrigger Interrupt Enable" mask="0x2"/>
               <bitfield name="CNT" caption="Counter Interrupt Enable" mask="0x4"/>
               <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x8"/>
               <bitfield name="DFS"
                         caption="Non-Recoverable Debug Fault Interrupt Enable"
                         mask="0x800"/>
               <bitfield name="FAULTA"
                         caption="Recoverable Fault A Interrupt Enable"
                         mask="0x1000"/>
               <bitfield name="FAULTB"
                         caption="Recoverable Fault B Interrupt Enable"
                         mask="0x2000"/>
               <bitfield name="FAULT0"
                         caption="Non-Recoverable Fault 0 Interrupt Enable"
                         mask="0x4000"/>
               <bitfield name="FAULT1"
                         caption="Non-Recoverable Fault 1 Interrupt Enable"
                         mask="0x8000"/>
               <bitfield name="MC0"
                         caption="Match or Capture Channel 0 Interrupt Enable"
                         mask="0x10000"/>
               <bitfield name="MC1"
                         caption="Match or Capture Channel 1 Interrupt Enable"
                         mask="0x20000"/>
               <bitfield name="MC2"
                         caption="Match or Capture Channel 2 Interrupt Enable"
                         mask="0x40000"/>
               <bitfield name="MC3"
                         caption="Match or Capture Channel 3 Interrupt Enable"
                         mask="0x80000"/>
            </register>
            <register name="INTENSET"
                      offset="0x28"
                      rw="RW"
                      size="4"
                      atomic-op="set:INTENSET"
                      initval="0x00000000"
                      caption="Interrupt Enable Set">
               <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
               <bitfield name="TRG" caption="Retrigger Interrupt Enable" mask="0x2"/>
               <bitfield name="CNT" caption="Counter Interrupt Enable" mask="0x4"/>
               <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x8"/>
               <bitfield name="DFS"
                         caption="Non-Recoverable Debug Fault Interrupt Enable"
                         mask="0x800"/>
               <bitfield name="FAULTA"
                         caption="Recoverable Fault A Interrupt Enable"
                         mask="0x1000"/>
               <bitfield name="FAULTB"
                         caption="Recoverable Fault B Interrupt Enable"
                         mask="0x2000"/>
               <bitfield name="FAULT0"
                         caption="Non-Recoverable Fault 0 Interrupt Enable"
                         mask="0x4000"/>
               <bitfield name="FAULT1"
                         caption="Non-Recoverable Fault 1 Interrupt Enable"
                         mask="0x8000"/>
               <bitfield name="MC0"
                         caption="Match or Capture Channel 0 Interrupt Enable"
                         mask="0x10000"/>
               <bitfield name="MC1"
                         caption="Match or Capture Channel 1 Interrupt Enable"
                         mask="0x20000"/>
               <bitfield name="MC2"
                         caption="Match or Capture Channel 2 Interrupt Enable"
                         mask="0x40000"/>
               <bitfield name="MC3"
                         caption="Match or Capture Channel 3 Interrupt Enable"
                         mask="0x80000"/>
            </register>
            <register name="INTFLAG"
                      offset="0x2C"
                      rw="RW"
                      size="4"
                      atomic-op="clear:INTFLAG"
                      initval="0x00000000"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="OVF" caption="Overflow" mask="0x1"/>
               <bitfield name="TRG" caption="Retrigger" mask="0x2"/>
               <bitfield name="CNT" caption="Counter" mask="0x4"/>
               <bitfield name="ERR" caption="Error" mask="0x8"/>
               <bitfield name="DFS" caption="Non-Recoverable Debug Fault" mask="0x800"/>
               <bitfield name="FAULTA" caption="Recoverable Fault A" mask="0x1000"/>
               <bitfield name="FAULTB" caption="Recoverable Fault B" mask="0x2000"/>
               <bitfield name="FAULT0" caption="Non-Recoverable Fault 0" mask="0x4000"/>
               <bitfield name="FAULT1" caption="Non-Recoverable Fault 1" mask="0x8000"/>
               <bitfield name="MC0" caption="Match or Capture 0" mask="0x10000"/>
               <bitfield name="MC1" caption="Match or Capture 1" mask="0x20000"/>
               <bitfield name="MC2" caption="Match or Capture 2" mask="0x40000"/>
               <bitfield name="MC3" caption="Match or Capture 3" mask="0x80000"/>
            </register>
            <register name="STATUS"
                      offset="0x30"
                      rw="RW"
                      size="4"
                      initval="0x00000001"
                      caption="Status">
               <bitfield name="STOP" caption="Stop" mask="0x1"/>
               <bitfield name="IDX" caption="Ramp" mask="0x2"/>
               <bitfield name="DFS" caption="Non-Recoverable Debug Fault State" mask="0x8"/>
               <bitfield name="SLAVE" caption="Slave" mask="0x10"/>
               <bitfield name="PATTBV" caption="Pattern Buffer Valid" mask="0x20"/>
               <bitfield name="WAVEBV" caption="Wave Buffer Valid" mask="0x40"/>
               <bitfield name="PERBV" caption="Period Buffer Valid" mask="0x80"/>
               <bitfield name="FAULTAIN" caption="Recoverable Fault A Input" mask="0x100"/>
               <bitfield name="FAULTBIN" caption="Recoverable Fault B Input" mask="0x200"/>
               <bitfield name="FAULT0IN" caption="Non-Recoverable Fault0 Input" mask="0x400"/>
               <bitfield name="FAULT1IN" caption="Non-Recoverable Fault1 Input" mask="0x800"/>
               <bitfield name="FAULTA" caption="Recoverable Fault A State" mask="0x1000"/>
               <bitfield name="FAULTB" caption="Recoverable Fault B State" mask="0x2000"/>
               <bitfield name="FAULT0" caption="Non-Recoverable Fault 0 State" mask="0x4000"/>
               <bitfield name="FAULT1" caption="Non-Recoverable Fault 1 State" mask="0x8000"/>
               <bitfield name="CCBV0"
                         caption="Compare Channel 0 Buffer Valid"
                         mask="0x10000"/>
               <bitfield name="CCBV1"
                         caption="Compare Channel 1 Buffer Valid"
                         mask="0x20000"/>
               <bitfield name="CCBV2"
                         caption="Compare Channel 2 Buffer Valid"
                         mask="0x40000"/>
               <bitfield name="CCBV3"
                         caption="Compare Channel 3 Buffer Valid"
                         mask="0x80000"/>
               <bitfield name="CMP0" caption="Compare Channel 0 Value" mask="0x1000000"/>
               <bitfield name="CMP1" caption="Compare Channel 1 Value" mask="0x2000000"/>
               <bitfield name="CMP2" caption="Compare Channel 2 Value" mask="0x4000000"/>
               <bitfield name="CMP3" caption="Compare Channel 3 Value" mask="0x8000000"/>
            </register>
            <register name="COUNT"
                      offset="0x34"
                      rw="RW"
                      access="RWSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="Count">
               <mode name="DITH4"/>
               <mode name="DITH5"/>
               <mode name="DITH6"/>
               <mode name="DEFAULT"/>
               <bitfield modes="DITH6"
                         name="COUNT"
                         caption="Counter Value"
                         mask="0xFFFFC0"/>
               <bitfield modes="DITH5"
                         name="COUNT"
                         caption="Counter Value"
                         mask="0xFFFFE0"/>
               <bitfield modes="DITH4"
                         name="COUNT"
                         caption="Counter Value"
                         mask="0xFFFFF0"/>
               <bitfield modes="DEFAULT"
                         name="COUNT"
                         caption="Counter Value"
                         mask="0xFFFFFF"/>
            </register>
