Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="PATT"
                      offset="0x38"
                      rw="RW"
                      access="WSYNC"
                      size="2"
                      initval="0x0000"
                      caption="Pattern">
               <bitfield name="PGE0" caption="Pattern Generator 0 Output Enable" mask="0x1"/>
               <bitfield name="PGE1" caption="Pattern Generator 1 Output Enable" mask="0x2"/>
               <bitfield name="PGE2" caption="Pattern Generator 2 Output Enable" mask="0x4"/>
               <bitfield name="PGE3" caption="Pattern Generator 3 Output Enable" mask="0x8"/>
               <bitfield name="PGE4" caption="Pattern Generator 4 Output Enable" mask="0x10"/>
               <bitfield name="PGE5" caption="Pattern Generator 5 Output Enable" mask="0x20"/>
               <bitfield name="PGE6" caption="Pattern Generator 6 Output Enable" mask="0x40"/>
               <bitfield name="PGE7" caption="Pattern Generator 7 Output Enable" mask="0x80"/>
               <bitfield name="PGV0" caption="Pattern Generator 0 Output Value" mask="0x100"/>
               <bitfield name="PGV1" caption="Pattern Generator 1 Output Value" mask="0x200"/>
               <bitfield name="PGV2" caption="Pattern Generator 2 Output Value" mask="0x400"/>
               <bitfield name="PGV3" caption="Pattern Generator 3 Output Value" mask="0x800"/>
               <bitfield name="PGV4"
                         caption="Pattern Generator 4 Output Value"
                         mask="0x1000"/>
               <bitfield name="PGV5"
                         caption="Pattern Generator 5 Output Value"
                         mask="0x2000"/>
               <bitfield name="PGV6"
                         caption="Pattern Generator 6 Output Value"
                         mask="0x4000"/>
               <bitfield name="PGV7"
                         caption="Pattern Generator 7 Output Value"
                         mask="0x8000"/>
            </register>
            <register name="WAVE"
                      offset="0x3C"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0x00000000"
                      caption="Waveform Control">
               <bitfield name="WAVEGEN"
                         caption="Waveform Generation"
                         mask="0x7"
                         values="TCC_WAVE__WAVEGEN"/>
               <bitfield name="RAMP"
                         caption="Ramp Mode"
                         mask="0x30"
                         values="TCC_WAVE__RAMP"/>
               <bitfield name="CIPEREN" caption="Circular period Enable" mask="0x80"/>
               <bitfield name="CICCEN0" caption="Circular Channel 0 Enable" mask="0x100"/>
               <bitfield name="CICCEN1" caption="Circular Channel 1 Enable" mask="0x200"/>
               <bitfield name="CICCEN2" caption="Circular Channel 2 Enable" mask="0x400"/>
               <bitfield name="CICCEN3" caption="Circular Channel 3 Enable" mask="0x800"/>
               <bitfield name="POL0" caption="Channel 0 Polarity" mask="0x10000"/>
               <bitfield name="POL1" caption="Channel 1 Polarity" mask="0x20000"/>
               <bitfield name="POL2" caption="Channel 2 Polarity" mask="0x40000"/>
               <bitfield name="POL3" caption="Channel 3 Polarity" mask="0x80000"/>
               <bitfield name="SWAP0" caption="Swap DTI Output Pair 0" mask="0x1000000"/>
               <bitfield name="SWAP1" caption="Swap DTI Output Pair 1" mask="0x2000000"/>
               <bitfield name="SWAP2" caption="Swap DTI Output Pair 2" mask="0x4000000"/>
               <bitfield name="SWAP3" caption="Swap DTI Output Pair 3" mask="0x8000000"/>
            </register>
            <register name="PER"
                      offset="0x40"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      initval="0xFFFFFFFF"
                      caption="Period">
               <mode name="DITH4"/>
               <mode name="DITH5"/>
               <mode name="DITH6"/>
               <mode name="DEFAULT"/>
               <bitfield modes="DITH4"
                         name="DITHERCY"
                         caption="Dithering Cycle Number"
                         mask="0xF"/>
               <bitfield modes="DITH5"
                         name="DITHERCY"
                         caption="Dithering Cycle Number"
                         mask="0x1F"/>
               <bitfield modes="DITH6"
                         name="DITHERCY"
                         caption="Dithering Cycle Number"
                         mask="0x3F"/>
               <bitfield modes="DITH6" name="PER" caption="Period Value" mask="0xFFFFC0"/>
               <bitfield modes="DITH5" name="PER" caption="Period Value" mask="0xFFFFE0"/>
               <bitfield modes="DITH4" name="PER" caption="Period Value" mask="0xFFFFF0"/>
               <bitfield modes="DEFAULT"
                         name="PER"
                         caption="Period Value"
                         mask="0xFFFFFF"/>
            </register>
            <register name="CC"
                      offset="0x44"
                      rw="RW"
                      size="4"
                      count="4"
                      initval="0x00000000"
                      caption="Compare and Capture">
               <mode name="DITH4"/>
               <mode name="DITH5"/>
               <mode name="DITH6"/>
               <mode name="DEFAULT"/>
               <bitfield modes="DITH4"
                         name="DITHERCY"
                         caption="Dithering Cycle Number"
                         mask="0xF"/>
               <bitfield modes="DITH5"
                         name="DITHERCY"
                         caption="Dithering Cycle Number"
                         mask="0x1F"/>
               <bitfield modes="DITH6"
                         name="DITHERCY"
                         caption="Dithering Cycle Number"
                         mask="0x3F"/>
               <bitfield modes="DITH6"
                         name="CC"
                         caption="Channel Compare/Capture Value"
                         mask="0xFFFFC0"/>
               <bitfield modes="DITH5"
                         name="CC"
                         caption="Channel Compare/Capture Value"
                         mask="0xFFFFE0"/>
               <bitfield modes="DITH4"
                         name="CC"
                         caption="Channel Compare/Capture Value"
                         mask="0xFFFFF0"/>
               <bitfield modes="DEFAULT"
                         name="CC"
                         caption="Channel Compare/Capture Value"
                         mask="0xFFFFFF"/>
            </register>
            <register name="PATTB"
                      offset="0x64"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Pattern Buffer">
               <bitfield name="PGEB0"
                         caption="Pattern Generator 0 Output Enable Buffer"
                         mask="0x1"/>
               <bitfield name="PGEB1"
                         caption="Pattern Generator 1 Output Enable Buffer"
                         mask="0x2"/>
               <bitfield name="PGEB2"
                         caption="Pattern Generator 2 Output Enable Buffer"
                         mask="0x4"/>
               <bitfield name="PGEB3"
                         caption="Pattern Generator 3 Output Enable Buffer"
                         mask="0x8"/>
               <bitfield name="PGEB4"
                         caption="Pattern Generator 4 Output Enable Buffer"
                         mask="0x10"/>
               <bitfield name="PGEB5"
                         caption="Pattern Generator 5 Output Enable Buffer"
                         mask="0x20"/>
               <bitfield name="PGEB6"
                         caption="Pattern Generator 6 Output Enable Buffer"
                         mask="0x40"/>
               <bitfield name="PGEB7"
                         caption="Pattern Generator 7 Output Enable Buffer"
                         mask="0x80"/>
               <bitfield name="PGVB0"
                         caption="Pattern Generator 0 Output Enable"
                         mask="0x100"/>
               <bitfield name="PGVB1"
                         caption="Pattern Generator 1 Output Enable"
                         mask="0x200"/>
               <bitfield name="PGVB2"
                         caption="Pattern Generator 2 Output Enable"
                         mask="0x400"/>
               <bitfield name="PGVB3"
                         caption="Pattern Generator 3 Output Enable"
                         mask="0x800"/>
               <bitfield name="PGVB4"
                         caption="Pattern Generator 4 Output Enable"
                         mask="0x1000"/>
               <bitfield name="PGVB5"
                         caption="Pattern Generator 5 Output Enable"
                         mask="0x2000"/>
               <bitfield name="PGVB6"
                         caption="Pattern Generator 6 Output Enable"
                         mask="0x4000"/>
               <bitfield name="PGVB7"
                         caption="Pattern Generator 7 Output Enable"
                         mask="0x8000"/>
            </register>
            <register name="WAVEB"
                      offset="0x68"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="Waveform Control Buffer">
               <bitfield name="WAVEGENB"
                         caption="Waveform Generation Buffer"
                         mask="0x7"
                         values="TCC_WAVEB__WAVEGENB"/>
               <bitfield name="RAMPB"
                         caption="Ramp Mode Buffer"
                         mask="0x30"
                         values="TCC_WAVEB__RAMPB"/>
               <bitfield name="CIPERENB" caption="Circular Period Enable Buffer" mask="0x80"/>
               <bitfield name="CICCENB0"
                         caption="Circular Channel 0 Enable Buffer"
                         mask="0x100"/>
               <bitfield name="CICCENB1"
                         caption="Circular Channel 1 Enable Buffer"
                         mask="0x200"/>
               <bitfield name="CICCENB2"
                         caption="Circular Channel 2 Enable Buffer"
                         mask="0x400"/>
               <bitfield name="CICCENB3"
                         caption="Circular Channel 3 Enable Buffer"
                         mask="0x800"/>
               <bitfield name="POLB0" caption="Channel 0 Polarity Buffer" mask="0x10000"/>
               <bitfield name="POLB1" caption="Channel 1 Polarity Buffer" mask="0x20000"/>
               <bitfield name="POLB2" caption="Channel 2 Polarity Buffer" mask="0x40000"/>
               <bitfield name="POLB3" caption="Channel 3 Polarity Buffer" mask="0x80000"/>
               <bitfield name="SWAPB0"
                         caption="Swap DTI Output Pair 0 Buffer"
                         mask="0x1000000"/>
               <bitfield name="SWAPB1"
                         caption="Swap DTI Output Pair 1 Buffer"
                         mask="0x2000000"/>
               <bitfield name="SWAPB2"
                         caption="Swap DTI Output Pair 2 Buffer"
                         mask="0x4000000"/>
               <bitfield name="SWAPB3"
                         caption="Swap DTI Output Pair 3 Buffer"
                         mask="0x8000000"/>
            </register>
            <register name="PERB"
                      offset="0x6C"
                      rw="RW"
                      size="4"
                      initval="0xFFFFFFFF"
                      caption="Period Buffer">
               <mode name="DITH4"/>
               <mode name="DITH5"/>
               <mode name="DITH6"/>
               <mode name="DEFAULT"/>
               <bitfield modes="DITH4"
                         name="DITHERCYB"
                         caption="Dithering Buffer Cycle Number"
                         mask="0xF"/>
               <bitfield modes="DITH5"
                         name="DITHERCYB"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x1F"/>
               <bitfield modes="DITH6"
                         name="DITHERCYB"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x3F"/>
               <bitfield modes="DITH6"
                         name="PERB"
                         caption="Period Buffer Value"
                         mask="0xFFFFC0"/>
               <bitfield modes="DITH5"
                         name="PERB"
                         caption="Period Buffer Value"
                         mask="0xFFFFE0"/>
               <bitfield modes="DITH4"
                         name="PERB"
                         caption="Period Buffer Value"
                         mask="0xFFFFF0"/>
               <bitfield modes="DEFAULT"
                         name="PERB"
                         caption="Period Buffer Value"
                         mask="0xFFFFFF"/>
            </register>
