Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
            <register name="CCB"
                      offset="0x70"
                      rw="RW"
                      size="4"
                      count="4"
                      initval="0x00000000"
                      caption="Compare and Capture Buffer">
               <mode name="DITH4"/>
               <mode name="DITH5"/>
               <mode name="DITH6"/>
               <mode name="DEFAULT"/>
               <bitfield modes="DITH4"
                         name="DITHERCYB"
                         caption="Dithering Buffer Cycle Number"
                         mask="0xF"/>
               <bitfield modes="DITH5"
                         name="DITHERCYB"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x1F"/>
               <bitfield modes="DITH6"
                         name="DITHERCYB"
                         caption="Dithering Buffer Cycle Number"
                         mask="0x3F"/>
               <bitfield modes="DITH6"
                         name="CCB"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xFFFFC0"/>
               <bitfield modes="DITH5"
                         name="CCB"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xFFFFE0"/>
               <bitfield modes="DITH4"
                         name="CCB"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xFFFFF0"/>
               <bitfield modes="DEFAULT"
                         name="CCB"
                         caption="Channel Compare/Capture Buffer Value"
                         mask="0xFFFFFF"/>
            </register>
         </register-group>
         <value-group name="TCC_CTRLA__PRESCALER">
            <value name="DIV1" caption="No division" value="0"/>
            <value name="DIV2" caption="Divide by 2" value="1"/>
            <value name="DIV4" caption="Divide by 4" value="2"/>
            <value name="DIV8" caption="Divide by 8" value="3"/>
            <value name="DIV16" caption="Divide by 16" value="4"/>
            <value name="DIV64" caption="Divide by 64" value="5"/>
            <value name="DIV256" caption="Divide by 256" value="6"/>
            <value name="DIV1024" caption="Divide by 1024" value="7"/>
         </value-group>
         <value-group name="TCC_CTRLA__PRESCSYNC">
            <value name="GCLK"
                   caption="Reload or reset counter on next GCLK"
                   value="0"/>
            <value name="PRESC"
                   caption="Reload or reset counter on next prescaler clock"
                   value="1"/>
            <value name="RESYNC"
                   caption="Reload or reset counter on next GCLK and reset prescaler counter"
                   value="2"/>
         </value-group>
         <value-group name="TCC_CTRLA__RESOLUTION">
            <value name="NONE" caption="Dithering is disabled" value="0"/>
            <value name="DITH4"
                   caption="Dithering is done every 16 PWM frames"
                   value="1"/>
            <value name="DITH5"
                   caption="Dithering is done every 32 PWM frames"
                   value="2"/>
            <value name="DITH6"
                   caption="Dithering is done every 64 PWM frames"
                   value="3"/>
         </value-group>
         <value-group name="TCC_CTRLBCLR__CMD">
            <value name="NONE" caption="No action" value="0"/>
            <value name="RETRIGGER"
                   caption="Clear start, restart or retrigger"
                   value="1"/>
            <value name="STOP" caption="Force stop" value="2"/>
            <value name="UPDATE"
                   caption="Force update of double buffered registers"
                   value="3"/>
            <value name="READSYNC"
                   caption="Force COUNT read synchronization"
                   value="4"/>
         </value-group>
         <value-group name="TCC_CTRLBCLR__IDXCMD">
            <value name="DISABLE"
                   caption="Command disabled: Index toggles between cycles A and B"
                   value="0"/>
            <value name="SET"
                   caption="Set index: cycle B will be forced in the next cycle"
                   value="1"/>
            <value name="CLEAR"
                   caption="Clear index: cycle A will be forced in the next cycle"
                   value="2"/>
            <value name="HOLD"
                   caption="Hold index: the next cycle will be the same as the current cycle"
                   value="3"/>
         </value-group>
         <value-group name="TCC_CTRLBSET__CMD">
            <value name="NONE" caption="No action" value="0"/>
            <value name="RETRIGGER"
                   caption="Clear start, restart or retrigger"
                   value="1"/>
            <value name="STOP" caption="Force stop" value="2"/>
            <value name="UPDATE"
                   caption="Force update of double buffered registers"
                   value="3"/>
            <value name="READSYNC"
                   caption="Force COUNT read synchronization"
                   value="4"/>
         </value-group>
         <value-group name="TCC_CTRLBSET__IDXCMD">
            <value name="DISABLE"
                   caption="Command disabled: Index toggles between cycles A and B"
                   value="0"/>
            <value name="SET"
                   caption="Set index: cycle B will be forced in the next cycle"
                   value="1"/>
            <value name="CLEAR"
                   caption="Clear index: cycle A will be forced in the next cycle"
                   value="2"/>
            <value name="HOLD"
                   caption="Hold index: the next cycle will be the same as the current cycle"
                   value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLA__BLANK">
            <value name="NONE" caption="No blanking applied" value="0"/>
            <value name="RISE"
                   caption="Blanking applied from rising edge of the output waveform"
                   value="1"/>
            <value name="FALL"
                   caption="Blanking applied from falling edge of the output waveform"
                   value="2"/>
            <value name="BOTH"
                   caption="Blanking applied from each toggle of the output waveform"
                   value="3"/>
         </value-group>
         <value-group name="TCC_FCTRLA__CAPTURE">
            <value name="DISABLE" caption="No capture" value="0"/>
            <value name="CAPT" caption="Capture on fault" value="1"/>
            <value name="CAPTMIN" caption="Minimum capture" value="2"/>
            <value name="CAPTMAX" caption="Maximum capture" value="3"/>
            <value name="LOCMIN" caption="Minimum local detection" value="4"/>
            <value name="LOCMAX" caption="Maximum local detection" value="5"/>
            <value name="DERIV0"
                   caption="Minimum and maximum local detection"
                   value="6"/>
         </value-group>
         <value-group name="TCC_FCTRLA__CHSEL">
            <value name="CC0" caption="Capture value stored in channel 0" value="0"/>
            <value name="CC1" caption="Capture value stored in channel 1" value="1"/>
            <value name="CC2" caption="Capture value stored in channel 2" value="2"/>
            <value name="CC3" caption="Capture value stored in channel 3" value="3"/>
         </value-group>
