Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/atdf/ATSAMHA1G17AB.atdf
         <value-group name="SysTick_CSR__ENABLE">
            <value name="VALUE_0" caption="Counter disabled" value="0"/>
            <value name="VALUE_1" caption="Counter enabled" value="1"/>
         </value-group>
         <value-group name="SysTick_CSR__TICKINT">
            <value name="VALUE_0"
                   caption="Counting down to 0 does not assert the SysTick exception request"
                   value="0"/>
            <value name="VALUE_1"
                   caption="Counting down to 0 asserts the SysTick exception request"
                   value="1"/>
         </value-group>
         <value-group name="SysTick_CALIB__NOREF">
            <value name="VALUE_0" caption="The reference clock is provided" value="0"/>
            <value name="VALUE_1"
                   caption="The reference clock is not provided"
                   value="1"/>
         </value-group>
         <value-group name="SysTick_CALIB__SKEW">
            <value name="VALUE_0" caption="10ms calibration value is exact" value="0"/>
            <value name="VALUE_1"
                   caption="10ms calibration value is inexact, because of the clock frequency"
                   value="1"/>
         </value-group>
      </module>
      <module name="SystemControl"
              version="1.0.0"
              caption="System Control Registers">
         <register-group name="SystemControl" caption="System Control Registers">
            <register name="CPUID"
                      offset="0xD00"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x410CC601"
                      caption="CPUID Base Register">
               <bitfield name="REVISION" caption="Minor revision number" mask="0xF"/>
               <bitfield name="PARTNO"
                         caption="Processor Part Number, 0xC60=Cortex-M0+"
                         mask="0xFFF0"/>
               <bitfield name="ARCHITECTURE"
                         caption="Processor Architecture, 0xC=ARMv6-M"
                         mask="0xF0000"/>
               <bitfield name="VARIANT" caption="Major revision number" mask="0xF00000"/>
               <bitfield name="IMPLEMENTER"
                         caption="Implementer code, ARM=0x41"
                         mask="0xFF000000"/>
            </register>
            <register name="ICSR"
                      offset="0xD04"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Interrupt Control and State Register">
               <bitfield name="VECTACTIVE"
                         caption="Debug: Exception number of currently executing exception, or 0 if thread mode"
                         mask="0x1FF"/>
               <bitfield name="VECTPENDING"
                         caption="Exception number of the highest priority pending enabled exception"
                         mask="0x1FF000"/>
               <bitfield name="ISRPENDING"
                         caption="Debug: NVIC interrupt pending"
                         mask="0x400000"/>
               <bitfield name="ISRPREEMPT"
                         caption="Debug: Pending exception serviced on exit from debug halt"
                         mask="0x800000"/>
               <bitfield name="PENDSTCLR"
                         caption="SysTick exception clear-pending bit"
                         mask="0x2000000"
                         values="SystemControl_ICSR__PENDSTCLR"/>
               <bitfield name="PENDSTSET"
                         caption="SysTick exception set-pending bit"
                         mask="0x4000000"
                         values="SystemControl_ICSR__PENDSTSET"/>
               <bitfield name="PENDSVCLR"
                         caption="PendSV clear-pending bit"
                         mask="0x8000000"
                         values="SystemControl_ICSR__PENDSVCLR"/>
               <bitfield name="PENDSVSET"
                         caption="PendSV set-pending bit"
                         mask="0x10000000"
                         values="SystemControl_ICSR__PENDSVSET"/>
               <bitfield name="NMIPENDSET"
                         caption="NMI set-pending bit"
                         mask="0x80000000"
                         values="SystemControl_ICSR__NMIPENDSET"/>
            </register>
            <register name="VTOR"
                      offset="0xD08"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Vector Table Offset Register">
               <bitfield name="TBLOFF" caption="Vector table base offset" mask="0xFFFFFF80"/>
            </register>
            <register name="AIRCR"
                      offset="0xD0C"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="Application Interrupt and Reset Control Register">
               <bitfield name="VECTCLRACTIVE"
                         caption="Debug: Clear state information"
                         mask="0x2"/>
               <bitfield name="SYSRESETREQ"
                         caption="System Reset Request"
                         mask="0x4"
                         values="SystemControl_AIRCR__SYSRESETREQ"/>
               <bitfield name="ENDIANNESS"
                         caption="Data Endianness, 0=little, 1=big"
                         mask="0x8000"
                         values="SystemControl_AIRCR__ENDIANNESS"/>
               <bitfield name="VECTKEY" caption="Register key (0x05FA)" mask="0xFFFF0000"/>
            </register>
            <register name="SCR"
                      offset="0xD10"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="System Control Register">
               <bitfield name="SLEEPONEXIT"
                         caption="Sleep-On-Exit when exiting Handler mode"
                         mask="0x2"
                         values="SystemControl_SCR__SLEEPONEXIT"/>
               <bitfield name="SLEEPDEEP"
                         caption="Uses Deep Sleep as low power mode"
                         mask="0x4"
                         values="SystemControl_SCR__SLEEPDEEP"/>
               <bitfield name="SEVONPEND"
                         caption="Send Event on Pending bit"
                         mask="0x10"
                         values="SystemControl_SCR__SEVONPEND"/>
            </register>
            <register name="CCR"
                      offset="0xD14"
                      rw="R"
                      size="4"
                      access-size="4"
                      initval="0x00000204"
                      caption="Configuration and Control Register">
               <bitfield name="UNALIGN_TRP"
                         caption="Unaligned accesses generates a Hard Fault"
                         mask="0x8"
                         values="SystemControl_CCR__UNALIGN_TRP"/>
               <bitfield name="STKALIGN"
                         caption="Stack 8-byte aligned on exception entry"
                         mask="0x200"
                         values="SystemControl_CCR__STKALIGN"/>
            </register>
            <register name="SHPR2"
                      offset="0xD1C"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="System Handler Priority Register 2">
               <bitfield name="PRI_11"
                         caption="Priority of system handler 11, SVCall"
                         mask="0xFF000000"/>
            </register>
            <register name="SHPR3"
                      offset="0xD20"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="System Handler Priority Register 3">
               <bitfield name="PRI_14"
                         caption="Priority of system handler 14, PendSV"
                         mask="0xFF0000"/>
               <bitfield name="PRI_15"
                         caption="Priority of system handler 15, SysTick exception"
                         mask="0xFF000000"/>
            </register>
            <register name="SHCSR"
                      offset="0xD24"
                      rw="RW"
                      size="4"
                      access-size="4"
                      initval="0x00000000"
                      caption="System Handler Control and State Register">
               <bitfield name="SVCALLPENDED"
                         caption="no description available"
                         mask="0x8000"/>
            </register>
